<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[mcservery.eu/blog]]></title><description><![CDATA[mcservery.eu blog]]></description><link>http://localhost:2368/</link><image><url>http://localhost:2368/favicon.png</url><title>mcservery.eu/blog</title><link>http://localhost:2368/</link></image><generator>Ghost 5.47</generator><lastBuildDate>Sun, 14 May 2023 22:12:53 GMT</lastBuildDate><atom:link href="http://localhost:2368/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Uživatelská jména na Discordu a propojení s mcservery.eu]]></title><description><![CDATA[<p>Discord ned&#xE1;vno ozn&#xE1;mil, &#x17E;e m&#x11B;n&#xED; zp&#x16F;sob, jak&#xFD;m zobrazuje u&#x17E;ivatelsk&#xE1; jm&#xE9;na, odstran&#x11B;n&#xED;m <a href="https://discord.fandom.com/wiki/Discriminator?ref=localhost">discriminatoru</a>. C&#xED;lem t&#xE9;to zm&#x11B;ny je &#xFA;dajn&#x11B; zlep&#x161;it u&</p>]]></description><link>http://localhost:2368/uzivatelska-jmena-na-discordu-a-propojeni-s-mcservery-eu/</link><guid isPermaLink="false">6461560eb56f0157e87c5457</guid><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Sun, 14 May 2023 21:48:56 GMT</pubDate><content:encoded><![CDATA[<p>Discord ned&#xE1;vno ozn&#xE1;mil, &#x17E;e m&#x11B;n&#xED; zp&#x16F;sob, jak&#xFD;m zobrazuje u&#x17E;ivatelsk&#xE1; jm&#xE9;na, odstran&#x11B;n&#xED;m <a href="https://discord.fandom.com/wiki/Discriminator?ref=localhost">discriminatoru</a>. C&#xED;lem t&#xE9;to zm&#x11B;ny je &#xFA;dajn&#x11B; zlep&#x161;it u&#x17E;ivatelskou zku&#x161;enost a sn&#xED;&#x17E;it zmatky mezi u&#x17E;ivateli s podobn&#xFD;mi jm&#xE9;ny. U&#x17E;ivatel&#xE9; ji&#x17E; nebudou muset zad&#xE1;vat discriminator, kter&#xFD; se skl&#xE1;dal z &#x10D;ty&#x159; &#x10D;&#xED;slic odd&#x11B;len&#xFD;ch od u&#x17E;ivatelsk&#xE9;ho jm&#xE9;na k&#x159;&#xED;&#x17E;kem (#), a m&#xED;sto toho si budou moci vybrat sv&#xE9; vlastn&#xED; unik&#xE1;tn&#xED; jm&#xE9;no.</p><figure class="kg-card kg-image-card kg-width-wide"><img src="http://localhost:2368/content/images/2023/05/645c294e1f5bcda693b9df11_usernames-blog-header-1.png" class="kg-image" alt loading="lazy" width="1800" height="720" srcset="http://localhost:2368/content/images/size/w600/2023/05/645c294e1f5bcda693b9df11_usernames-blog-header-1.png 600w, http://localhost:2368/content/images/size/w1000/2023/05/645c294e1f5bcda693b9df11_usernames-blog-header-1.png 1000w, http://localhost:2368/content/images/size/w1600/2023/05/645c294e1f5bcda693b9df11_usernames-blog-header-1.png 1600w, http://localhost:2368/content/images/2023/05/645c294e1f5bcda693b9df11_usernames-blog-header-1.png 1800w" sizes="(min-width: 1200px) 1200px"></figure><p>Vzhledem k t&#xE9;to zm&#x11B;n&#x11B; se mus&#xED; tak&#xE9; p&#x159;izp&#x16F;sobit i mcservery.eu. Pro u&#x17E;ivatele, kte&#x159;&#xED; propojili sv&#x16F;j &#xFA;&#x10D;et s Discordem, m&#x16F;&#x17E;e tato zm&#x11B;na ovlivnit u&#x17E;ivatelsk&#xE9; &#xFA;daje zobrazen&#xE9; na webu, proto&#x17E;e V&#xE1;&#x161; profil na mcservery.eu zobrazoval Discord discriminator jako sou&#x10D;&#xE1;st u&#x17E;ivatelsk&#xE9;ho jm&#xE9;na z Discordu.</p><p>Pokud je&#x161;t&#x11B; nem&#xE1;te propojen&#xFD; sv&#x16F;j &#xFA;&#x10D;et s Discordem, st&#xE1;le je to mo&#x17E;n&#xE9;, ale pouze pokud pou&#x17E;&#xED;v&#xE1;te p&#x16F;vodn&#xED; tvar u&#x17E;ivatelsk&#xFD;ch jmen. <strong>Propojen&#xED; &#xFA;&#x10D;t&#x16F; moment&#xE1;ln&#x11B; nepodporuje nov&#xFD; tvar.</strong> Proto&#x17E;e tento p&#x159;echod bude ze strany Discordu trvat del&#x161;&#xED; dobu, nem&#x16F;&#x17E;eme zaru&#x10D;it, &#x17E;e propojen&#xED; bude v&#x17E;dy pln&#x11B; funk&#x10D;n&#xED;.</p><p><strong>Moment&#xE1;ln&#x11B; se p&#x159;ipravuje nov&#xFD; syst&#xE9;m, kter&#xFD; umo&#x17E;n&#xED; snadn&#x11B;j&#x161;&#xED; propojen&#xED; Va&#x161;eho Discord &#xFA;&#x10D;tu s mcservery.eu. Pokud se ale s propojen&#xED;m objev&#xED; jak&#xE9;koli probl&#xE9;my, nev&#xE1;hejte m&#x11B; kontaktovat na <a href="https://discord.mcservery.eu/?ref=localhost">Discordu </a>nebo na emailu admin@mcservery.eu.</strong></p><blockquote>&#x201E;V nadch&#xE1;zej&#xED;c&#xED;ch t&#xFD;dnech za&#x10D;neme u&#x17E;ivatele upozor&#x148;ovat na mo&#x17E;nost aktualizovat sv&#x16F;j &#xFA;&#x10D;et na nov&#xE9; u&#x17E;ivatelsk&#xE9; jm&#xE9;no, tak&#x17E;e a&#x17E; na v&#xE1;s p&#x159;ijde &#x159;ada, o&#x10D;ek&#xE1;vejte v aplikaci upozorn&#x11B;n&#xED;.</blockquote><blockquote>B&#x11B;hem p&#x159;echodu budou v&#x161;ichni u&#x17E;ivatel&#xE9; slu&#x17E;by Discord vyzv&#xE1;ni k v&#xFD;b&#x11B;ru nov&#xE9;ho u&#x17E;ivatelsk&#xE9;ho jm&#xE9;na a p&#x159;&#xED;stup se bude pomalu roz&#x161;i&#x159;ovat v pr&#x16F;b&#x11B;hu n&#x11B;kolika m&#x11B;s&#xED;c&#x16F;. Chceme b&#xFD;t obzvl&#xE1;&#x161;t&#x11B; ohledupln&#xED; k dlouholet&#xFD;m u&#x17E;ivatel&#x16F;m slu&#x17E;by Discord, kte&#x159;&#xED; maj&#xED; sv&#xE1; u&#x17E;ivatelsk&#xE1; jm&#xE9;na ji&#x17E; del&#x161;&#xED; dobu, tak&#x17E;e budeme p&#x159;i&#x159;azovat prioritu v&#xFD;b&#x11B;ru nov&#xE9;ho u&#x17E;ivatelsk&#xE9;ho jm&#xE9;na podle toho, kdy jste se do slu&#x17E;by Discord zaregistrovali. Co se t&#xFD;&#x10D;e zav&#xE1;d&#x11B;n&#xED;, za&#x10D;neme s p&#x159;&#xED;stupem pro majitele partnersk&#xFD;ch a ov&#x11B;&#x159;en&#xFD;ch server&#x16F;, v n&#xE1;sleduj&#xED;c&#xED;ch m&#x11B;s&#xED;c&#xED;ch pak pro v&#x161;echny u&#x17E;ivatele na z&#xE1;klad&#x11B; st&#xE1;&#x159;&#xED; jejich &#xFA;&#x10D;tu, po&#x10D;&#xED;naje rokem 2015. Sou&#x10D;asn&#xED; p&#x159;edplatitel&#xE9; slu&#x17E;by Nitro, kte&#x159;&#xED; si plat&#xED; mo&#x17E;nost p&#x159;izp&#x16F;soben&#xED; sv&#xE9;ho diskrimin&#xE1;toru a kte&#x159;&#xED; se zaregistrovali do slu&#x17E;by Nitro 1. b&#x159;ezna 2023 nebo d&#x159;&#xED;ve, budou m&#xED;t tak&#xE9; p&#x159;ed&#x10D;asn&#xFD; p&#x159;&#xED;stup.&#x201C; - Zdroj: <a href="https://discord.com/blog/usernames?ref=localhost">blog.discord.com</a></blockquote>]]></content:encoded></item><item><title><![CDATA[McServery API: Žebříček hlasujících na Váš web]]></title><description><![CDATA[<p>V dne&#x161;n&#xED;m &#x10D;l&#xE1;nku se pod&#xED;v&#xE1;me na dva r&#x16F;zn&#xE9; zp&#x16F;soby, jak zobrazit &#x17E;eb&#x159;&#xED;&#x10D;ek po&#x10D;tu hlas&#x16F; od jednotliv&#xFD;ch hr&#xE1;&#x10D;&#x16F; ze server listu u</p>]]></description><link>http://localhost:2368/mcservery-api-zebricek-hlasujicich-pro-vas-server/</link><guid isPermaLink="false">6456c5fd70918407c803ee11</guid><category><![CDATA[Server list]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Sat, 06 May 2023 23:48:28 GMT</pubDate><content:encoded><![CDATA[<p>V dne&#x161;n&#xED;m &#x10D;l&#xE1;nku se pod&#xED;v&#xE1;me na dva r&#x16F;zn&#xE9; zp&#x16F;soby, jak zobrazit &#x17E;eb&#x159;&#xED;&#x10D;ek po&#x10D;tu hlas&#x16F; od jednotliv&#xFD;ch hr&#xE1;&#x10D;&#x16F; ze server listu u V&#xE1;s na str&#xE1;nk&#xE1;ch va&#x161;eho Minecraft serveru. Tento &#x17E;eb&#x159;&#xED;&#x10D;ek hlasuj&#xED;c&#xED;ch m&#x16F;&#x17E;e b&#xFD;t u&#x17E;ite&#x10D;n&#xFD; pro majitele Minecraft serveru, kte&#x159;&#xED; cht&#x11B;j&#xED; uk&#xE1;zat nejaktivn&#x11B;j&#x161;&#xED; hr&#xE1;&#x10D;e a odm&#x11B;nit je za jejich p&#x159;isp&#x11B;n&#xED;.</p><p>K&#xF3;d by m&#x11B;l b&#xFD;t br&#xE1;n p&#x159;edev&#x161;&#xED;m jako inspirace, jak implementovat tuto pro hr&#xE1;&#x10D;e zaj&#xED;mavou statistiku kter&#xE1; je bude motivovat k aktivn&#x11B;j&#x161;&#xED;mu hlasov&#xE1;n&#xED; pro V&#xE1;&#x161; server. Pro tento p&#x159;&#xED;klad budeme pou&#x17E;&#xED;vat endpoit <a href="https://help.mcservery.eu/spravci-serveru/api?ref=localhost#hlasovani">/players/</a> kter&#xFD; zobrazuje jednotliv&#x11B; v&#x161;echny hlasy pro V&#xE1;&#x161; server za posledn&#xED;ch 30 dn&#xED;.</p><p>M&#xE1;me zde dv&#x11B; hodnoty a to je username pro jm&#xE9;no hr&#xE1;&#x10D;e kter&#xFD; hlasoval pro dan&#xFD; server a time kter&#xE1; zobrazuje &#x10D;as kdy byl hlas serveru ud&#x11B;len.</p><p>k&#xF3;d zpracov&#xE1;v&#xE1; JSON s daty obsahuj&#xED;c&#xED;mi informace o jednotliv&#xFD;ch ud&#x11B;len&#xFD;ch hlasech u&#x17E;ivateli a vytv&#xE1;&#x159;&#xED; tabulku, kter&#xE1; zobrazuje po&#x10D;et odeslan&#xFD;ch hlas&#x16F; od ka&#x17E;d&#xE9;ho u&#x17E;ivatele, se&#x159;azenou sestupn&#x11B; podle po&#x10D;tu aktivit. K&#xF3;d za&#x10D;&#xED;n&#xE1; p&#x159;eveden&#xED;m JSON na pole asociativn&#xED;ch pol&#xED;. N&#xE1;sledn&#x11B; proch&#xE1;z&#xED; ka&#x17E;d&#xFD; z&#xE1;znam a zaznamen&#xE1;v&#xE1; po&#x10D;et aktivit pro ka&#x17E;d&#xE9;ho u&#x17E;ivatele. Pot&#xE9; se u&#x17E;ivatel&#xE9; se&#x159;ad&#xED; podle po&#x10D;tu aktivit a vytvo&#x159;&#xED; se tabulka, kter&#xE1; zobrazuje po&#x10D;et aktivit pro ka&#x17E;d&#xE9;ho u&#x17E;ivatele.</p><p>Prvn&#xED;m krokem bude z&#xED;sk&#xE1;n&#xED; API kl&#xED;&#x10D;e pro V&#xE1;&#x161; server. Ten z&#xED;sk&#xE1;te po p&#x159;ihl&#xE1;&#x161;en&#xED; na detailn&#xED; str&#xE1;nce Va&#x161;eho serveru. <a href="https://help.mcservery.eu/spravci-serveru/api?ref=localhost#ziskani-klice">Zde p&#x159;esn&#xFD; n&#xE1;vod</a>, jak kl&#xED;&#x10D; z&#xED;skat.</p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://1273476476-files.gitbook.io/~/files/v0/b/gitbook-x-prod.appspot.com/o/spaces%2FAOok7TR34rUY0wlqXHGV%2Fuploads%2Fgit-blob-acb8681ef3934a2a700e97c416ace3be108b19f2%2Fimage.png?alt=media" class="kg-image" alt loading="lazy"><figcaption>Box pro &#xFA;pravu Va&#x161;eho serveru - zde z&#xED;sk&#xE1;te pot&#x159;ebn&#xFD; API kl&#xED;&#x10D;.</figcaption></figure><h2 id="php">PHP</h2><p>Prvn&#xED; zp&#x16F;sob vyu&#x17E;&#xED;v&#xE1; PHP. Pomoc&#xED; API lze z&#xED;skat data v JSON form&#xE1;tu a n&#xE1;sledn&#x11B; je zpracovat v PHP. V&#xFD;sledkem je tabulka s po&#x10D;tem hlas&#x16F; a jm&#xE9;nem hr&#xE1;&#x10D;e, se&#x159;azen&#xE1; dle po&#x159;ad&#xED;. Tento p&#x159;&#xED;stup m&#x16F;&#x17E;e b&#xFD;t u&#x17E;ite&#x10D;n&#xFD; pro majitele serveru, kte&#x159;&#xED; maj&#xED; webov&#xE9; str&#xE1;nky postaven&#xE9; na PHP a cht&#x11B;j&#xED; data zpracov&#xE1;vat na serverov&#xE9; stran&#x11B;.</p><!--kg-card-begin: markdown--><pre><code class="language-markup">&lt;?php

$apiKey = &apos;&apos;; // API Kl&#xED;&#x10D; Va&#x161;eho serveru

// p&#x159;ev&#xE9;st JSON na pole asociativn&#xED;ch pol&#xED;
$data = json_decode(file_get_contents(&apos;https://api.mcservery.eu/players/?api_key=&apos; . $apiKey), true);

// spo&#x10D;&#xED;tat po&#x10D;et z&#xE1;znam&#x16F; od ka&#x17E;d&#xE9;ho u&#x17E;ivatele
$counts = array();
foreach ($data as $record) {
    $username = $record[&apos;username&apos;];
    if (isset($counts[$username])) {
        $counts[$username]++;
    } else {
        $counts[$username] = 1;
    }
}

// se&#x159;adit u&#x17E;ivatele podle po&#x10D;tu z&#xE1;znam&#x16F;
arsort($counts);

// vytvo&#x159;it seznam ve form&#xE1;tu tabulky
echo &apos;&lt;table&gt;&apos;;
echo &apos;&lt;tr&gt;&lt;th&gt;Hr&#xE1;&#x10D;&lt;/th&gt;&lt;th&gt;Po&#x10D;et hlas&#x16F;&lt;/th&gt;&lt;/tr&gt;&apos;;
foreach ($counts as $username =&gt; $count) {
    echo &apos;&lt;tr&gt;&lt;td&gt;&apos; . $username . &apos;&lt;/td&gt;&lt;td&gt;&apos; . $count . &apos;&lt;/td&gt;&lt;/tr&gt;&apos;;
}
echo &apos;&lt;tr&gt;&lt;td&gt;Hlasuj na &lt;a href=&quot;https://mcservery.eu&quot;&gt;mcservery.eu&lt;/a&gt;&lt;/td&gt;&lt;/tr&gt;&apos;;
echo &apos;&lt;/table&gt;&apos;;
</code></pre>
<!--kg-card-end: markdown--><h2 id="javascript">JavaScript</h2><p>Druh&#xFD; zp&#x16F;sob vyu&#x17E;&#xED;v&#xE1; JavaScript. Data se stahuj&#xED; pomoc&#xED; API v JSON form&#xE1;tu a jsou n&#xE1;sledn&#x11B; zpracov&#xE1;v&#xE1;na v JavaScriptu. V&#xFD;sledkem je op&#x11B;t tabulka s po&#x10D;tem hlas&#x16F; a jm&#xE9;nem hr&#xE1;&#x10D;e, se&#x159;azen&#xE1; dle po&#x159;ad&#xED;. Tento p&#x159;&#xED;stup m&#x16F;&#x17E;e b&#xFD;t u&#x17E;ite&#x10D;n&#xFD; pro majitele serveru, kte&#x159;&#xED; cht&#x11B;j&#xED; data zpracov&#xE1;vat na stran&#x11B; klienta a vyu&#x17E;&#xED;vat dynamick&#xE9;ho zobrazov&#xE1;n&#xED;.</p><p>Pomoc&#xED; tohoto k&#xF3;du z&#xED;sk&#xE1;me pomoc&#xED; API data a n&#xE1;sledn&#x11B; je zpracujeme:</p><!--kg-card-begin: markdown--><pre><code class="language-javascript">const apiURL = &quot;https://api.mcservery.eu/players/?api_key=&quot;;
const apiKey = &quot;&quot;;
const usersTableBody = document.getElementById(&quot;users-table-body&quot;);

fetch(apiURL + apiKey)
  .then((response) =&gt; response.json())
  .then((data) =&gt; {
    const usersMap = new Map();

    data.forEach((entry) =&gt; {
      const username = entry.username;
      const count = usersMap.has(username) ? usersMap.get(username) + 1 : 1;
      usersMap.set(username, count);
    });

    const usersArray = Array.from(usersMap);

    usersArray.sort((a, b) =&gt; b[1] - a[1]);

    usersArray.forEach((entry) =&gt; {
      const row = document.createElement(&quot;tr&quot;);
      const usernameCell = document.createElement(&quot;td&quot;);
      const countCell = document.createElement(&quot;td&quot;);

      usernameCell.innerText = entry[0];
      countCell.innerText = entry[1];

      row.appendChild(usernameCell);
      row.appendChild(countCell);

      usersTableBody.appendChild(row);
    });
  })
  .catch((error) =&gt; console.error(error));
</code></pre>
<!--kg-card-end: markdown--><p>Pro zobrazen&#xED; tabulky s daty na str&#xE1;nce bude je&#x161;t&#x11B; nutn&#xE9; p&#x159;idat html k&#xF3;d, jako je nap&#x159;&#xED;klad tento:</p><!--kg-card-begin: markdown--><pre><code class="language-html">&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;Seznam u&#x17E;ivatel&#x16F;&lt;/title&gt;
  &lt;/head&gt;

  &lt;body&gt;
    &lt;table&gt;
      &lt;thead&gt;
        &lt;tr&gt;
          &lt;th&gt;Hr&#xE1;&#x10D;&lt;/th&gt;
          &lt;th&gt;Po&#x10D;et hlas&#x16F;&lt;/th&gt;
        &lt;/tr&gt;
      &lt;/thead&gt;
      &lt;tbody id=&quot;users-table-body&quot;&gt;&lt;/tbody&gt;
      &lt;td&gt;Hlasuj na: &lt;a href=&quot;https://mcservery.eu&quot;&gt;mcservery.eu&lt;/a&gt;&lt;/td&gt;
    &lt;/table&gt;
  &lt;/body&gt;
&lt;/html&gt;
</code></pre>
<!--kg-card-end: markdown--><figure class="kg-card kg-image-card kg-card-hascaption"><img src="http://localhost:2368/content/images/2023/05/Sn-mek-obrazovky-2023-05-07-013436.png" class="kg-image" alt loading="lazy" width="261" height="207"><figcaption>V&#xFD;sledek</figcaption></figure><p>Douf&#xE1;m, &#x17E;e v&#xE1;m tyto uk&#xE1;zky pomohou l&#xE9;pe pochopit, jak m&#x16F;&#x17E;ete pou&#x17E;&#xED;t API pro z&#xED;sk&#xE1;n&#xED; dat z <a href="https://mcservery.eu/?ref=localhost">mcservery.eu</a> o Va&#x161;em Minecraft serveru. U obou uk&#xE1;zek jsem z&#xE1;m&#x11B;rn&#x11B; neuvedl CSS, jeliko&#x17E; v&#x11B;&#x159;&#xED;m &#x17E;e k&#xF3;d poslou&#x17E;&#xED; jako inspirace pro va&#x161;i vlastn&#xED; tvorbu.</p><div class="kg-card kg-callout-card kg-callout-card-blue"><div class="kg-callout-emoji">&#x1F4A1;</div><div class="kg-callout-text">Zaj&#xED;maly by T&#x11B; dal&#x161;&#xED; uk&#xE1;zky, jak lze pou&#x17E;&#xED;t na&#x161;e API? Navrhni na <a href="https://discord.mcservery.eu/?ref=localhost">Discordu </a>jakou dal&#x161;&#xED; uk&#xE1;zku bys cht&#x11B;l vid&#x11B;t!</div></div>]]></content:encoded></item><item><title><![CDATA[Jak vybudovat úspěšný Minecraft server: Strategie a tipy]]></title><description><![CDATA[<p>Pokud jste majitelem Minecraft serveru, pravd&#x11B;podobn&#x11B; hled&#xE1;te zp&#x16F;soby, jak zv&#xFD;&#x161;it po&#x10D;et hr&#xE1;&#x10D;&#x16F; a ud&#x11B;lat sv&#x16F;j server popul&#xE1;rn&#x11B;j&#x161;&#xED;. V tomto &#x10D;l&#xE1;nku s v&</p>]]></description><link>http://localhost:2368/jak-vybudovat-uspesny-minecraft-server/</link><guid isPermaLink="false">6437293dd8d3086244845f27</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Wed, 12 Apr 2023 22:46:52 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1550745165-9bc0b252726f?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDkyfHxjb21tdW5pdHklMjBnYW1pbmd8ZW58MHx8fHwxNjgxMzM5NDgy&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1550745165-9bc0b252726f?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDkyfHxjb21tdW5pdHklMjBnYW1pbmd8ZW58MHx8fHwxNjgxMzM5NDgy&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Jak vybudovat &#xFA;sp&#x11B;&#x161;n&#xFD; Minecraft server: Strategie a tipy"><p>Pokud jste majitelem Minecraft serveru, pravd&#x11B;podobn&#x11B; hled&#xE1;te zp&#x16F;soby, jak zv&#xFD;&#x161;it po&#x10D;et hr&#xE1;&#x10D;&#x16F; a ud&#x11B;lat sv&#x16F;j server popul&#xE1;rn&#x11B;j&#x161;&#xED;. V tomto &#x10D;l&#xE1;nku s v&#xE1;mi budeme sd&#xED;let n&#x11B;kolik tip&#x16F; a strategi&#xED;, jak toho m&#x16F;&#x17E;ete dos&#xE1;hnout.</p><h2 id="vyberte-si-spr%C3%A1vn%C3%BD-hosting">Vyberte si spr&#xE1;vn&#xFD; hosting</h2><p>volba spr&#xE1;vn&#xE9;ho hostingu pro v&#xE1;&#x161; Minecraft server je kl&#xED;&#x10D;ov&#xE1; pro jeho &#xFA;sp&#x11B;ch. Kdy&#x17E; si vyb&#xED;r&#xE1;te hosting pro sv&#x16F;j server, mus&#xED;te vz&#xED;t v &#xFA;vahu n&#x11B;kolik faktor&#x16F;.</p><ol><li><strong>V&#xFD;kon a spolehlivost:</strong> Je d&#x16F;le&#x17E;it&#xE9; zvolit hosting, kter&#xFD; poskytuje dostate&#x10D;n&#xFD; v&#xFD;kon a spolehlivost pro v&#xE1;&#x161; server. Server mus&#xED; b&#xFD;t schopen zvl&#xE1;dnout n&#xE1;v&#x161;t&#x11B;vnost a po&#x17E;adavky va&#x161;ich hr&#xE1;&#x10D;&#x16F;, aby se hra plynule odehr&#xE1;vala bez lag&#x16F; a v&#xFD;padk&#x16F;.</li><li><strong>Dostupnost technick&#xE9; podpory:</strong> Pokud se vyskytnou probl&#xE9;my s va&#x161;&#xED;m serverem, budete cht&#xED;t m&#xED;t rychl&#xFD; a efektivn&#xED; zp&#x16F;sob, jak je &#x159;e&#x161;it. Proto je d&#x16F;le&#x17E;it&#xE9; zvolit hosting, kter&#xFD; poskytuje technickou podporu 24/7.</li><li><strong>P&#x159;izp&#x16F;soben&#xED;:</strong> Pokud si p&#x159;ejete p&#x159;izp&#x16F;sobit sv&#x16F;j server a nainstalovat r&#x16F;zn&#xE9; pluginy, je d&#x16F;le&#x17E;it&#xE9; zvolit hosting, kter&#xFD; v&#xE1;m umo&#x17E;n&#xED; upravit nastaven&#xED; a instalovat pluginy a modifikace.</li><li><strong>Cena:</strong> Cena hostingov&#xFD;ch slu&#x17E;eb se m&#x16F;&#x17E;e v&#xFD;razn&#x11B; li&#x161;it. Mus&#xED;te se rozhodnout, kolik jste ochotni investovat do sv&#xE9;ho Minecraft serveru a naj&#xED;t hosting, kter&#xFD; nab&#xED;z&#xED; vyv&#xE1;&#x17E;en&#xFD; pom&#x11B;r mezi cenou a kvalitou slu&#x17E;eb.</li></ol><p>Pamatujte si, &#x17E;e zvolen&#xED; spr&#xE1;vn&#xE9;ho hostingu m&#x16F;&#x17E;e pomoci maximalizovat &#xFA;sp&#x11B;ch va&#x161;eho Minecraft serveru. Proto je d&#x16F;le&#x17E;it&#xE9; d&#x16F;kladn&#x11B; vyb&#xED;rat a porovn&#xE1;vat r&#x16F;zn&#xE9; mo&#x17E;nosti hostingov&#xFD;ch slu&#x17E;eb.</p><figure class="kg-card kg-bookmark-card kg-card-hascaption"><a class="kg-bookmark-container" href="https://mcservery.eu/blog/raspberry-pi-4-minecraft-server-s-dockerem-a-ngrok-bez-potreby-verejne-ip-adresy/index.html?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Raspberry Pi 4 Minecraft server s Dockerem a ngrok - Bez pot&#x159;eby ve&#x159;ejn&#xE9; IP adresy</div><div class="kg-bookmark-description">V tomto &#x10D;l&#xE1;nku se dozv&#xED;te, jak vytvo&#x159;it Minecraft server na Raspberry Pi 4 bez pot&#x159;eby nastavovat port forwarding na va&#x161;em routeru a vlastnit ve&#x159;ejnou ip adresu. M&#xED;sto toho pou&#x17E;ijeme ngrok k vytvo&#x159;en&#xED; bezpe&#x10D;n&#xE9;ho tunelu pro p&#x159;ipojen&#xED; z internetu. Na rozd&#xED;l od jin&#xFD;ch mo&#x17E;nost&#xED;, jak hostovat v&#xE1;&#x161; Minecr&#x2026;</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://mcservery.eu/blog/content/images/size/w256h256/2023/04/logo-1.PNG" alt="Jak vybudovat &#xFA;sp&#x11B;&#x161;n&#xFD; Minecraft server: Strategie a tipy"><span class="kg-bookmark-author">mcservery.eu/blog</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://images.unsplash.com/photo-1552283576-3ea3519bf12e?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDV8fHJhc3BiZXJyeSUyMFBpfGVufDB8fHx8MTY4MDYxNDgyNg&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Jak vybudovat &#xFA;sp&#x11B;&#x161;n&#xFD; Minecraft server: Strategie a tipy"></div></a><figcaption>Minecraft server m&#x16F;&#x17E;ete hostovat i doma t&#x159;eba pomoc&#xED; Raspberry Pi</figcaption></figure><p>VPS (Virtual Private Server) je dal&#x161;&#xED; mo&#x17E;nost, jak hostovat Minecraft server. Jedn&#xE1; se o virtu&#xE1;ln&#xED; stroj, kter&#xFD; je hostov&#xE1;n na fyzick&#xE9;m serveru. VPS v&#xE1;m poskytuje plnou kontrolu nad va&#x161;&#xED;m serverem, jako byste ho hostovali sami. Na rozd&#xED;l od sd&#xED;len&#xE9;ho hostingu, VPS v&#xE1;m umo&#x17E;&#x148;uje m&#xED;t p&#x159;&#xED;stup ke ko&#x159;enov&#xE9;mu adres&#xE1;&#x159;i a instalovat vlastn&#xED; software a aplikace jako nap&#x159;&#xED;klad Apache, MySQL a PHP pro webov&#xE9; str&#xE1;nky va&#x161;eho serveru.</p><p>VPS m&#x16F;&#x17E;e b&#xFD;t v&#xFD;hodn&#x11B;j&#x161;&#xED; pro ty, kte&#x159;&#xED; cht&#x11B;j&#xED; m&#xED;t plnou kontrolu nad sv&#xFD;m serverem a pot&#x159;ebuj&#xED; v&#xED;ce prostoru, ne&#x17E; co nab&#xED;z&#xED; sd&#xED;len&#xFD; hosting. VPS v&#xE1;m tak&#xE9; umo&#x17E;&#x148;uje p&#x159;izp&#x16F;sobit v&#xFD;kon va&#x161;eho serveru podle va&#x161;ich pot&#x159;eb. Av&#x161;ak, VPS m&#x16F;&#x17E;e b&#xFD;t dra&#x17E;&#x161;&#xED; ne&#x17E; sd&#xED;len&#xFD; hosting a tak&#xE9; vy&#x17E;aduje ur&#x10D;it&#xE9; technick&#xE9; znalosti a zku&#x161;enosti, aby byl efektivn&#x11B; spravov&#xE1;n.</p><p>V&#xFD;b&#x11B;r mezi sd&#xED;len&#xFD;m hostingem a VPS z&#xE1;vis&#xED; na va&#x161;ich pot&#x159;eb&#xE1;ch a schopnostech. Pokud m&#xE1;te omezen&#xFD; rozpo&#x10D;et a nechcete se starat o technickou str&#xE1;nku v&#x11B;ci, sd&#xED;len&#xFD; hosting m&#x16F;&#x17E;e b&#xFD;t pro v&#xE1;s lep&#x161;&#xED; volbou. Pokud ale pot&#x159;ebujete plnou kontrolu nad sv&#xFD;m serverem a m&#xE1;te technick&#xE9; zku&#x161;enosti, VPS m&#x16F;&#x17E;e b&#xFD;t v&#xFD;hodn&#x11B;j&#x161;&#xED; alternativou.</p><div class="kg-card kg-header-card kg-width-full kg-size-medium kg-style-image" style="background-image: url(http://localhost:2368/content/images/2023/04/minecraft-kv-v2-bottom-parallax-3-desktop-1.jpg)" data-kg-background-image="http://localhost:2368/content/images/2023/04/minecraft-kv-v2-bottom-parallax-3-desktop-1.jpg"><h2 class="kg-header-card-header" id="vytvo%C5%99te-zaj%C3%ADmav%C3%A9-sv%C4%9Bty">Vytvo&#x159;te zaj&#xED;mav&#xE9; sv&#x11B;ty</h2></div><p>Jedn&#xED;m z nejd&#x16F;le&#x17E;it&#x11B;j&#x161;&#xED;ch aspekt&#x16F; &#xFA;sp&#x11B;&#x161;n&#xE9;ho Minecraft serveru jsou zaj&#xED;mav&#xE9; sv&#x11B;ty, kter&#xE9; p&#x159;il&#xE1;kaj&#xED; hr&#xE1;&#x10D;e a udr&#x17E;&#xED; je na serveru. Zde jsou n&#x11B;kter&#xE9; zp&#x16F;soby, jak m&#x16F;&#x17E;ete vytvo&#x159;it zaj&#xED;mav&#xE9; sv&#x11B;ty pro sv&#x16F;j Minecraft server</p><p><strong>Pl&#xE1;nujte sv&#x11B;ty p&#x159;edem:</strong> Ne&#x17E; za&#x10D;nete s vytv&#xE1;&#x159;en&#xED;m sv&#x11B;t&#x16F;, je d&#x16F;le&#x17E;it&#xE9; pl&#xE1;novat, co do nich um&#xED;st&#xED;te. Zva&#x17E;te, co by mohlo b&#xFD;t zaj&#xED;mav&#xE9; pro hr&#xE1;&#x10D;e, jako nap&#x159;&#xED;klad skryt&#xE9; jeskyn&#x11B;, mal&#xE9; vesnice, z&#x159;&#xED;ceniny nebo tajemn&#xE9; vstupy. Pokud pl&#xE1;nujete vytv&#xE1;&#x159;et komplexn&#xED; sv&#x11B;ty, zva&#x17E;te pou&#x17E;it&#xED; n&#xE1;stroj&#x16F; pro tvorbu sv&#x11B;t&#x16F;, kter&#xE9; v&#xE1;m mohou pomoci vytvo&#x159;it slo&#x17E;it&#xE9; ter&#xE9;ny, jako jsou hory, &#x159;eky nebo mo&#x159;e.</p><p><strong>P&#x159;izp&#x16F;sobte sv&#x11B;ty hr&#xE1;&#x10D;&#x16F;m:</strong> Ne ka&#x17E;d&#xFD; hr&#xE1;&#x10D; hled&#xE1; stejn&#xFD; druh z&#xE1;bavy, proto je d&#x16F;le&#x17E;it&#xE9; p&#x159;izp&#x16F;sobit sv&#x11B;ty r&#x16F;zn&#xFD;m hr&#xE1;&#x10D;&#x16F;m. Zva&#x17E;te vytvo&#x159;en&#xED; sv&#x11B;t&#x16F; ur&#x10D;en&#xFD;ch pro stavebn&#xED; sout&#x11B;&#x17E;e, PvP bitvy nebo pro p&#x159;e&#x17E;it&#xED; v divo&#x10D;in&#x11B;. Vytvo&#x159;te sv&#x11B;ty, kter&#xE9; jsou vhodn&#xE9; pro v&#x161;echny hr&#xE1;&#x10D;e, bez ohledu na to, zda jsou zku&#x161;en&#xED; hr&#xE1;&#x10D;i nebo nov&#xE1;&#x10D;ci.</p><p><strong>Vyu&#x17E;ijte pluginy a m&#xF3;dy:</strong> Pluginy a m&#xF3;dy mohou b&#xFD;t skv&#x11B;l&#xFD;m zp&#x16F;sobem, jak roz&#x161;&#xED;&#x159;it z&#xE1;bavu v Minecraftu a p&#x159;idat do sv&#x11B;t&#x16F; nov&#xE9; prvky. Existuje mnoho plugin&#x16F;, kter&#xE9; umo&#x17E;&#x148;uj&#xED; hr&#xE1;&#x10D;&#x16F;m vytv&#xE1;&#x159;et a upravovat vlastn&#xED; sv&#x11B;ty, p&#x159;id&#xE1;vat nov&#xE9; bloky a p&#x159;edm&#x11B;ty, a dokonce i implementovat vlastn&#xED; hern&#xED; mechaniky. Zva&#x17E;te pou&#x17E;it&#xED; plugin&#x16F; a m&#xF3;du pro vytvo&#x159;en&#xED; sv&#x11B;t&#x16F;, kter&#xE9; jsou unik&#xE1;tn&#xED; a zaj&#xED;mav&#xE9; pro hr&#xE1;&#x10D;e.</p><p><strong>P&#x159;idejte questy a v&#xFD;zvy:</strong> Questy a v&#xFD;zvy mohou b&#xFD;t skv&#x11B;l&#xFD;m zp&#x16F;sobem, jak udr&#x17E;et hr&#xE1;&#x10D;e zapojen&#xE9; a motivovan&#xE9;. Vytvo&#x159;te &#xFA;koly, kter&#xE9; hr&#xE1;&#x10D;i mus&#xED; splnit, aby z&#xED;skali odm&#x11B;ny, jako jsou vz&#xE1;cn&#xE9; p&#x159;edm&#x11B;ty nebo zku&#x161;enostn&#xED; body.</p><h2 id="budujte-komunitu">Budujte komunitu</h2><p>Podpora komunity je d&#x16F;le&#x17E;it&#xFD;m aspektem p&#x159;i budov&#xE1;n&#xED; &#xFA;sp&#x11B;&#x161;n&#xE9;ho Minecraft serveru. Komunita se skl&#xE1;d&#xE1; z hr&#xE1;&#x10D;&#x16F;, kte&#x159;&#xED; hraj&#xED; na va&#x161;em serveru, a vytv&#xE1;&#x159;&#xED; si na n&#x11B;m z&#xE1;&#x17E;itky. Je d&#x16F;le&#x17E;it&#xE9; b&#xFD;t vst&#x159;&#xED;cn&#xFD; a aktivn&#x11B; se zapojovat do komunity, aby se hr&#xE1;&#x10D;i c&#xED;tili v&#xED;t&#xE1;ni a aby se na serveru c&#xED;tili jako doma.</p><p>Existuje mnoho zp&#x16F;sob&#x16F;, jak podporovat komunitu. Jedn&#xED;m z nich je vytv&#xE1;&#x159;en&#xED; p&#x159;&#xE1;telsk&#xE9; a pozitivn&#xED; atmosf&#xE9;ry na serveru. Moder&#xE1;to&#x159;i by m&#x11B;li b&#xFD;t p&#x159;&#xE1;tel&#x161;t&#xED;, ochotn&#xED; pomoci a spravedliv&#xED; p&#x159;i &#x159;e&#x161;en&#xED; konflikt&#x16F;. M&#x16F;&#x17E;ete tak&#xE9; vytvo&#x159;it t&#xFD;m dobrovoln&#xED;k&#x16F;, kte&#x159;&#xED; budou pom&#xE1;hat hr&#xE1;&#x10D;&#x16F;m a moder&#xE1;tor&#x16F;m.</p><p>Dal&#x161;&#xED;m zp&#x16F;sobem, jak podpo&#x159;it komunitu, je poskytov&#xE1;n&#xED; pravideln&#xFD;ch aktualizac&#xED; a vylep&#x161;en&#xED; serveru. Hr&#xE1;&#x10D;i budou m&#xED;t v&#x11B;t&#x161;&#xED; z&#xE1;jem hr&#xE1;t na serveru, kter&#xFD; se pravideln&#x11B; aktualizuje a m&#xE1; nov&#xE9; funkce. Je tak&#xE9; dobr&#xE9; poskytovat hr&#xE1;&#x10D;&#x16F;m mo&#x17E;nost ovlivnit sm&#x11B;&#x159;ov&#xE1;n&#xED; serveru, nap&#x159;&#xED;klad vytv&#xE1;&#x159;en&#xED;m ankety nebo p&#x159;ij&#xED;m&#xE1;n&#xED;m n&#xE1;vrh&#x16F; na nov&#xE9; funkce.</p><p>Dal&#x161;&#xED;m zp&#x16F;sobem, jak podpo&#x159;it komunitu, je po&#x159;&#xE1;d&#xE1;n&#xED; akc&#xED; a sout&#x11B;&#x17E;&#xED;. Akce a sout&#x11B;&#x17E;e mohou b&#xFD;t r&#x16F;zn&#xE9;ho druhu, nap&#x159;&#xED;klad stav&#x11B;c&#xED; sout&#x11B;&#x17E;e, PvP turnaje, nebo adventury. Tyto akce mohou p&#x159;it&#xE1;hnout nov&#xE9; hr&#xE1;&#x10D;e a udr&#x17E;et st&#xE1;vaj&#xED;c&#xED; hr&#xE1;&#x10D;e anga&#x17E;ovan&#xE9;.</p><p>V neposledn&#xED; &#x159;ad&#x11B; je d&#x16F;le&#x17E;it&#xE9; vytvo&#x159;it f&#xF3;rum pro hr&#xE1;&#x10D;e, kde se mohou setkat a diskutovat o serveru. F&#xF3;rum umo&#x17E;&#x148;uje hr&#xE1;&#x10D;&#x16F;m sd&#xED;let sv&#xE9; n&#xE1;pady, probl&#xE9;my a tipy, a tak&#xE9; umo&#x17E;&#x148;uje hr&#xE1;&#x10D;&#x16F;m vytvo&#x159;it si vlastn&#xED; partu p&#x159;&#xE1;tel na serveru.</p><p>Podpora komunity je kl&#xED;&#x10D;ov&#xFD;m faktorem pro &#xFA;sp&#x11B;&#x161;n&#xFD; Minecraft server. Pokud budete m&#xED;t vst&#x159;&#xED;cnou a pozitivn&#xED; atmosf&#xE9;ru na serveru, pravideln&#x11B; aktualizujete server a po&#x159;&#xE1;d&#xE1;te akce a sout&#x11B;&#x17E;e, budou hr&#xE1;&#x10D;i m&#xED;t v&#x11B;t&#x161;&#xED; z&#xE1;jem hr&#xE1;t na va&#x161;em serveru a va&#x161;e komunita se bude rozr&#x16F;stat.</p><h2 id="nab%C3%ADdn%C4%9Bte-jedine%C4%8Dn%C3%BD-hern%C3%AD-z%C3%A1%C5%BEitek">Nab&#xED;dn&#x11B;te jedine&#x10D;n&#xFD; hern&#xED; z&#xE1;&#x17E;itek</h2><p>Kdy&#x17E; se lid&#xE9; p&#x159;ipojuj&#xED;, cht&#x11B;j&#xED; za&#x17E;&#xED;t n&#x11B;co, co nemohou naj&#xED;t na jin&#xFD;ch serverech. Proto je d&#x16F;le&#x17E;it&#xE9; nab&#xED;dnout jim jedine&#x10D;n&#xFD; hern&#xED; z&#xE1;&#x17E;itek. Zde je n&#x11B;kolik tip&#x16F;, jak toho doc&#xED;lit:</p><ol><li><strong>Vytvo&#x159;te vlastn&#xED; pluginy:</strong> Pluginy jsou skv&#x11B;l&#xFD;m zp&#x16F;sobem, jak p&#x159;idat nov&#xE9; prvky do hry. Pokud vytvo&#x159;&#xED;te sv&#xE9; vlastn&#xED; pluginy, m&#x16F;&#x17E;ete p&#x159;idat nov&#xE9; funkce, kter&#xE9; nikde jinde nejsou k dispozici.</li><li><strong>Vytvo&#x159;te vlastn&#xED; mapy:</strong> Krom&#x11B; plugin&#x16F; m&#x16F;&#x17E;ete vytvo&#x159;it tak&#xE9; vlastn&#xED; mapy, kter&#xE9; nab&#xED;dnou hr&#xE1;&#x10D;&#x16F;m unik&#xE1;tn&#xED; hern&#xED; z&#xE1;&#x17E;itek. Bu&#x10F;te kreativn&#xED; a vytvo&#x159;te mapy s r&#x16F;zn&#xFD;mi &#xFA;rovn&#x11B;mi obt&#xED;&#x17E;nosti, tajn&#xFD;mi m&#xED;sty a dal&#x161;&#xED;mi zaj&#xED;mav&#xFD;mi prvky.</li><li><strong>Organizujte speci&#xE1;ln&#xED; ud&#xE1;losti:</strong> Hostov&#xE1;n&#xED; speci&#xE1;ln&#xED;ch ud&#xE1;lost&#xED; je skv&#x11B;l&#xFD;m zp&#x16F;sobem, jak p&#x159;il&#xE1;kat hr&#xE1;&#x10D;e na server. M&#x16F;&#x17E;ete organizovat nap&#x159;&#xED;klad tematick&#xE9; akce, z&#xE1;vody, nebo dokonce <a href="https://happygamer.com/hospitality-in-the-void-is-a-virtual-music-event-in-minecraft-hosted-by-mad-zoo-and-hospitality-76127/?ref=localhost">&#x17E;iv&#xE9; koncerty</a>. Tato jedine&#x10D;n&#xE1; z&#xE1;&#x17E;itky budou m&#xED;t hr&#xE1;&#x10D;i r&#xE1;di a budou se k serveru r&#xE1;di vracet.</li><li><strong>Poskytn&#x11B;te hr&#xE1;&#x10D;&#x16F;m r&#x16F;zn&#xE9; mo&#x17E;nosti:</strong> Hr&#xE1;&#x10D;i maj&#xED; r&#x16F;zn&#xE9; z&#xE1;jmy, a tak byste m&#x11B;li nab&#xED;dnout r&#x16F;zn&#xE9; hern&#xED; re&#x17E;imy, kter&#xE9; uspokoj&#xED; v&#x161;echny hr&#xE1;&#x10D;e. Pokud nap&#x159;&#xED;klad m&#xE1;te server zam&#x11B;&#x159;en&#xFD; na p&#x159;e&#x17E;it&#xED;, m&#x16F;&#x17E;ete z&#xE1;rove&#x148; nab&#xED;zet i minihry nebo Creative re&#x17E;im pro hr&#xE1;&#x10D;e, kte&#x159;&#xED; si cht&#x11B;j&#xED; jen tak zahr&#xE1;t.</li></ol><p>Nab&#xED;dnut&#xED;m jedine&#x10D;n&#xE9;ho hern&#xED;ho z&#xE1;&#x17E;itku na va&#x161;em serveru m&#x16F;&#x17E;ete p&#x159;il&#xE1;kat hr&#xE1;&#x10D;e a udr&#x17E;et je na serveru d&#xE9;le. Nav&#xED;c, kdy&#x17E; hr&#xE1;&#x10D;i zjist&#xED;, &#x17E;e na va&#x161;em serveru najdou n&#x11B;co nov&#xE9;ho a zaj&#xED;mav&#xE9;ho, mohou sv&#xFD;m p&#x159;&#xE1;tel&#x16F;m doporu&#x10D;it v&#xE1;&#x161; server, co&#x17E; v&#xE1;m pom&#x16F;&#x17E;e r&#x16F;st a z&#xED;sk&#xE1;vat nov&#xE9; hr&#xE1;&#x10D;e.</p><h2 id="zapojte-se-do-minecraft-komunit">Zapojte se do Minecraft komunit</h2><p>Existuje mnoho Minecraft komunit online, v&#x10D;etn&#x11B; f&#xF3;r, <a href="https://discord.mcservery.eu/?ref=localhost">Discord server&#x16F;</a> a Reddit skupin. &#xDA;&#x10D;ast v t&#x11B;chto komunit&#xE1;ch je skv&#x11B;l&#xFD;m zp&#x16F;sobem, jak se spojit s ostatn&#xED;mi hr&#xE1;&#x10D;i Minecraftu a propagovat v&#xE1;&#x161; server. Sd&#xED;lejte aktualizace o va&#x161;em serveru a &#x17E;&#xE1;dejte o zp&#x11B;tnou vazbu, kter&#xE1; v&#xE1;m pom&#x16F;&#x17E;e ho vylep&#x161;it.</p><p>Je d&#x16F;le&#x17E;it&#xE9;, aby va&#x161;e zapojen&#xED; do Minecraft komunity bylo p&#x159;irozen&#xE9; a autentick&#xE9;. Sna&#x17E;te se zapojovat do komunity, kter&#xE9; jsou pro v&#xE1;s relevantn&#xED;, a bu&#x10F;te vst&#x159;&#xED;cn&#xED; a ochotn&#xED; pomoci ostatn&#xED;m hr&#xE1;&#x10D;&#x16F;m. Takov&#xE9; chov&#xE1;n&#xED; v&#xE1;s pom&#x16F;&#x17E;e z&#xED;skat respekt a pov&#x11B;st jako seri&#xF3;zn&#xED;ho a kvalitn&#xED;ho vlastn&#xED;ka serveru.</p><h2 id="propagujte-sv%C5%AFj-server">Propagujte sv&#x16F;j server</h2><p>Soci&#xE1;ln&#xED; m&#xE9;dia jsou skv&#x11B;l&#xFD;m zp&#x16F;sobem, jak oslovit velk&#xE9; mno&#x17E;stv&#xED; lid&#xED; a propagovat sv&#x16F;j server. Vytvo&#x159;te &#xFA;&#x10D;ty na popul&#xE1;rn&#xED;ch platform&#xE1;ch jako jsou Twitter, Facebook a Instagram a pravideln&#x11B; zve&#x159;ej&#x148;ujte aktualizace o va&#x161;em serveru. Ur&#x10D;it&#x11B; zahr&#x148;te screenshoty a videa va&#x161;eho serveru, aby hr&#xE1;&#x10D;i m&#x11B;li chu&#x165; se p&#x159;idat, a vid&#x11B;li co na serveru mohou o&#x10D;ek&#xE1;vat.</p><p>P&#x159;id&#xE1;n&#xED; serveru na <a href="https://mcservery.eu/?ref=localhost">server list</a> (seznam server&#x16F;) m&#x16F;&#x17E;e b&#xFD;t velmi prosp&#x11B;&#x161;n&#xE9; pro r&#x16F;st va&#x161;eho Minecraft serveru. Tyto server listy jsou webov&#xE9; str&#xE1;nky, kter&#xE9; seznamuj&#xED; hr&#xE1;&#x10D;e s r&#x16F;zn&#xFD;mi Minecraft servery, a umo&#x17E;&#x148;uj&#xED; jim snadno vyhledat a p&#x159;ipojit se k server&#x16F;m podle ur&#x10D;it&#xFD;ch krit&#xE9;ri&#xED;.</p><p>Krom&#x11B; toho, &#x17E;e se hr&#xE1;&#x10D;i mohou snadno p&#x159;ipojit k va&#x161;emu serveru, m&#x16F;&#x17E;ete tak&#xE9; z&#xED;skat exponenci&#xE1;ln&#xED; n&#xE1;r&#x16F;st n&#xE1;v&#x161;t&#x11B;vnosti va&#x161;eho serveru. Kdy&#x17E; se hr&#xE1;&#x10D;i p&#x159;ipojuj&#xED; k serveru p&#x159;es server list, mohou vid&#x11B;t popisy va&#x161;eho serveru a zjistit v&#xED;ce o tom, co v&#xE1;&#x161; server nab&#xED;z&#xED;. Pokud se jim to l&#xED;b&#xED;, mohou se rozhodnout z&#x16F;stat na serveru d&#xE9;le nebo se vr&#xE1;tit pozd&#x11B;ji.</p><p><strong>Pokud chcete, aby se o va&#x161;em Minecraft serveru dozv&#x11B;d&#x11B;lo co nejv&#xED;ce hr&#xE1;&#x10D;&#x16F;, doporu&#x10D;ujeme ho p&#x159;idat na server list <a href="https://mcservery.eu/?ref=localhost">mcservery.eu</a>. Tento server list je velmi obl&#xED;ben&#xFD; a m&#x16F;&#x17E;e v&#xE1;m pomoci z&#xED;skat nov&#xE9; hr&#xE1;&#x10D;e a zv&#xFD;&#x161;it n&#xE1;v&#x161;t&#x11B;vnost va&#x161;eho serveru.</strong></p><figure class="kg-card kg-image-card kg-width-wide kg-card-hascaption"><img src="https://mcservery.eu/stats/images/stats-screen-main-desktop.png" class="kg-image" alt="Jak vybudovat &#xFA;sp&#x11B;&#x161;n&#xFD; Minecraft server: Strategie a tipy" loading="lazy"><figcaption><a href="https://mcservery.eu/stats?ref=localhost">McStats</a> v&#xE1;m pom&#x16F;&#x17E;e z&#xED;skat detailn&#xED; statistiky o va&#x161;em Minecraft serveru</figcaption></figure><h2 id="sledujte-analytiku">Sledujte analytiku</h2><p>Sledov&#xE1;n&#xED; analytiky je d&#x16F;le&#x17E;it&#xFD;m krokem pro ka&#x17E;d&#xE9;ho, kdo chce m&#xED;t &#xFA;sp&#x11B;&#x161;n&#xFD; Minecraft server. Analytika v&#xE1;m poskytuje kl&#xED;&#x10D;ov&#xE9; informace o va&#x161;ich hr&#xE1;&#x10D;&#xED;ch, jak&#xE9; akce podnikaj&#xED; a jak interaguj&#xED; s va&#x161;&#xED;m serverem. K tomu m&#x16F;&#x17E;ete pou&#x17E;&#xED;t nap&#x159;&#xED;klad n&#xE1;&#x161; n&#xE1;stroj <a href="https://mcservery.eu/stats?ref=localhost">McStats</a>, jak ji&#x17E; z n&#xE1;zvu vypl&#xFD;v&#xE1; slou&#x17E;&#xED; k z&#xED;skan&#xED; statistik o va&#x161;em Minecraft serveru.</p><p>sledov&#xE1;n&#xED; statistik v&#xE1;m umo&#x17E;n&#xED; zhodnotit &#xFA;sp&#x11B;ch va&#x161;ich marketingov&#xFD;ch kampan&#xED;. Pokud jste nap&#x159;&#xED;klad pr&#xE1;v&#x11B; spustili novou reklamn&#xED; kampa&#x148; na soci&#xE1;ln&#xED;ch s&#xED;t&#xED;ch, m&#x16F;&#x17E;ete sledovat, zda se zv&#xFD;&#x161;il po&#x10D;et hr&#xE1;&#x10D;&#x16F; na va&#x161;em serveru. Pokud tomu tak je, m&#x16F;&#x17E;ete se rozhodnout v budoucnu v&#x11B;novat v&#xED;ce pozornosti va&#x161;im soci&#xE1;ln&#xED;m s&#xED;t&#xED;m pro zv&#xFD;&#x161;en&#xED; viditelnosti serveru.</p><p></p><p><em>Budov&#xE1;n&#xED; &#xFA;sp&#x11B;&#x161;n&#xE9;ho Minecraft serveru vy&#x17E;aduje kombinaci &#xFA;sil&#xED;, kreativity a pozornosti k detail&#x16F;m. Pokud budete n&#xE1;sledovat tipy a strategie uveden&#xE9; v tomto &#x10D;l&#xE1;nku, m&#x16F;&#x17E;ete p&#x159;il&#xE1;kat nov&#xE9; hr&#xE1;&#x10D;e, udr&#x17E;et st&#xE1;vaj&#xED;c&#xED; a vytvo&#x159;it prosperuj&#xED;c&#xED; komunitu kolem sv&#xE9;ho serveru.</em></p><p><em>Nezapome&#x148;te propagovat sv&#x16F;j server na soci&#xE1;ln&#xED;ch s&#xED;t&#xED;ch, p&#x159;idat na server list, vytvo&#x159;it webovou str&#xE1;nku a zapojit se do Minecraft komunit, abyste zv&#xFD;&#x161;ili viditelnost va&#x161;eho serveru. Nab&#xED;dn&#x11B;te hr&#xE1;&#x10D;&#x16F;m jedine&#x10D;n&#xFD; server, aby se p&#x159;ipojili a z&#x16F;stali jako st&#xE1;l&#xED; hr&#xE1;&#x10D;i, po&#x159;&#xE1;dejte ud&#xE1;losti a sout&#x11B;&#x17E;e, aby byli zapojeni do chodu komunity, a optimalizujte sv&#x16F;j server, aby b&#x11B;&#x17E;el plynule.</em></p><p><em>Nem&#x11B;li byste zapomenout pravideln&#x11B; sledovat analytiku sv&#xE9;ho serveru a d&#x11B;lat pot&#x159;ebn&#xE9; &#xFA;pravy, aby st&#xE1;le spl&#x148;oval pot&#x159;eby a o&#x10D;ek&#xE1;v&#xE1;n&#xED; va&#x161;ich hr&#xE1;&#x10D;&#x16F;. T&#xED;mto zp&#x16F;sobem a v&#x11B;nov&#xE1;n&#xED;m pot&#x159;ebn&#xE9;ho &#x10D;asu a &#xFA;sil&#xED; m&#x16F;&#x17E;ete vybudovat &#xFA;sp&#x11B;&#x161;n&#xFD; Minecraft server, kter&#xFD; bude i nad&#xE1;le r&#x16F;st a prosp&#xED;vat po mnoho let.</em></p>]]></content:encoded></item><item><title><![CDATA[Jak najít nejlepší Minecraft servery pro hraní s přáteli]]></title><description><![CDATA[<p><strong>Hled&#xE1;te skv&#x11B;l&#xFD; server pro hran&#xED; Minecraftu s va&#x161;imi p&#x159;&#xE1;teli? S tolika r&#x16F;zn&#xFD;mi servery tam venku m&#x16F;&#x17E;e b&#xFD;t obt&#xED;&#x17E;n&#xE9; naj&#xED;t ten nejlep&#x161;&#xED;. V</strong></p>]]></description><link>http://localhost:2368/jak-najit-nejlepsi-minecraft-servery-pro-hrani-s-prateli/</link><guid isPermaLink="false">642df79db7485065a0e65ebf</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Wed, 05 Apr 2023 23:00:05 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1636487410078-b517f4daca8d?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDM5MXx8Z2FtZXJ8ZW58MHx8fHwxNjgwNzM1MjYw&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1636487410078-b517f4daca8d?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDM5MXx8Z2FtZXJ8ZW58MHx8fHwxNjgwNzM1MjYw&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Jak naj&#xED;t nejlep&#x161;&#xED; Minecraft servery pro hran&#xED; s p&#x159;&#xE1;teli"><p><strong>Hled&#xE1;te skv&#x11B;l&#xFD; server pro hran&#xED; Minecraftu s va&#x161;imi p&#x159;&#xE1;teli? S tolika r&#x16F;zn&#xFD;mi servery tam venku m&#x16F;&#x17E;e b&#xFD;t obt&#xED;&#x17E;n&#xE9; naj&#xED;t ten nejlep&#x161;&#xED;. V tomto &#x10D;l&#xE1;nku v&#xE1;m poskytneme n&#x11B;kolik tip&#x16F; a trik&#x16F;, jak naj&#xED;t ten nejlep&#x161;&#xED; Minecraft server pro v&#xE1;s a va&#x161;e p&#x159;&#xE1;tele.</strong></p><h2 id="vyu%C5%BEijte-server-listy">Vyu&#x17E;ijte server listy</h2><p>Server listy jsou skv&#x11B;l&#xFD;m zdrojem pro hled&#xE1;n&#xED; nov&#xFD;ch server&#x16F;. Tyto webov&#xE9; str&#xE1;nky obsahuj&#xED; seznamy server&#x16F; se&#x159;azen&#xFD;ch podle kategorie, po&#x10D;tu hr&#xE1;&#x10D;&#x16F;, zem&#x11B;pisn&#xE9;ho um&#xED;st&#x11B;n&#xED; a dal&#x161;&#xED;ch faktor&#x16F;. Server listy jsou snadno dostupn&#xE9; online a &#x10D;asto poskytuj&#xED; recenze a hodnocen&#xED; od ostatn&#xED;ch hr&#xE1;&#x10D;&#x16F;, tak&#x17E;e se m&#x16F;&#x17E;ete rozhodnout, zda si chcete server vyzkou&#x161;et nebo ne. Vyzkou&#x161;ejte t&#x159;eba tento <a href="https://mcservery.eu/?ref=localhost">server list</a>, kde Minecraft servery &#x159;ad&#xED;me dle obl&#xED;benosti.</p><h2 id="pou%C5%BEijte-google">Pou&#x17E;ijte Google</h2><p>Jestli&#x17E;e m&#xE1;te specifickou p&#x159;edstavu o tom, jak&#xFD; server hled&#xE1;te, Google je va&#x161;&#xED;m nejlep&#x161;&#xED;m p&#x159;&#xED;telem. Sta&#x10D;&#xED; zadat kl&#xED;&#x10D;ov&#xE1; slova spojen&#xE1; s hledan&#xFD;m serverem a m&#x16F;&#x17E;ete naj&#xED;t mnoho r&#x16F;zn&#xFD;ch v&#xFD;sledk&#x16F;. Pokud nev&#xED;te, jak&#xE1; kl&#xED;&#x10D;ov&#xE1; slova pou&#x17E;&#xED;t, zkuste nap&#x159;&#xED;klad &quot;nejlep&#x161;&#xED; Minecraft server pro hran&#xED; s p&#x159;&#xE1;teli&quot; nebo &quot;Minecraft server pro t&#xFD;mov&#xE9; hry&quot;.</p><h2 id="zkuste-minecraft-f%C3%B3ra">Zkuste Minecraft f&#xF3;ra</h2><p>Minecraft f&#xF3;ra jsou dal&#x161;&#xED;m skv&#x11B;l&#xFD;m zdrojem pro hled&#xE1;n&#xED; server&#x16F;. Tyto f&#xF3;ra jsou &#x10D;asto zam&#x11B;&#x159;eny na r&#x16F;zn&#xE9; t&#xE9;mata a maj&#xED; speci&#xE1;ln&#xED; sekce pro prezentaci a reklamu na servery. Proch&#xE1;zen&#xED;m f&#xF3;r m&#x16F;&#x17E;ete naj&#xED;t i r&#x16F;zn&#xE9; tipy a triky pro hran&#xED; na serverech a m&#x16F;&#x17E;ete se p&#x159;ipojit k r&#x16F;zn&#xFD;m Minecraft komunit&#xE1;m.</p><h2 id="zeptejte-se-sv%C3%BDch-p%C5%99%C3%A1tel">Zeptejte se sv&#xFD;ch p&#x159;&#xE1;tel</h2><p>Pokud m&#xE1;te kamar&#xE1;dy, kte&#x159;&#xED; hraj&#xED; Minecraft, zeptejte se jich na rady a doporu&#x10D;en&#xED;. Mohou v&#xE1;m poskytnout informace o servery, na kter&#xFD;ch se sami bav&#xED;, a mohou v&#xE1;m dokonce nab&#xED;dnout mo&#x17E;nost hr&#xE1;t spole&#x10D;n&#x11B; s nimi.</p><h2 id="vyzkou%C5%A1ejte-n%C4%9Bkolik-server%C5%AF">Vyzkou&#x161;ejte n&#x11B;kolik server&#x16F;</h2><p>Nejlep&#x161;&#xED;m zp&#x16F;sobem, jak naj&#xED;t ten nejlep&#x161;&#xED; Minecraft server pro sebe a sv&#xE9; p&#x159;&#xE1;tele, je vyzkou&#x161;et n&#x11B;kolik server&#x16F;. Hran&#xED;m na r&#x16F;zn&#xFD;ch typech server&#x16F; zjist&#xED;te, co v&#xE1;m nejv&#xED;ce vyhovuje a co byste cht&#x11B;li na serveru naj&#xED;t. A pokud naraz&#xED;te na n&#x11B;jak&#xFD; server, kter&#xFD; se v&#xE1;m opravdu l&#xED;b&#xED;, nezapome&#x148;te se zeptat ostatn&#xED;ch</p><figure class="kg-card kg-image-card kg-width-wide"><img src="http://localhost:2368/content/images/2023/04/3990025-1.webp" class="kg-image" alt="Jak naj&#xED;t nejlep&#x161;&#xED; Minecraft servery pro hran&#xED; s p&#x159;&#xE1;teli" loading="lazy" width="2000" height="1125" srcset="http://localhost:2368/content/images/size/w600/2023/04/3990025-1.webp 600w, http://localhost:2368/content/images/size/w1000/2023/04/3990025-1.webp 1000w, http://localhost:2368/content/images/size/w1600/2023/04/3990025-1.webp 1600w, http://localhost:2368/content/images/size/w2400/2023/04/3990025-1.webp 2400w" sizes="(min-width: 1200px) 1200px"></figure><p>D&#xE1;le je d&#x16F;le&#x17E;it&#xE9; tak&#xE9; vyb&#xED;rat servery s p&#x159;&#xE1;telskou komunitou. Kdy&#x17E; se p&#x159;ipoj&#xED;te na server, kde jsou hr&#xE1;&#x10D;i v&#x161;ude kolem v&#xE1;s naprosto bez reakc&#xED; a nikdo se v&#xE1;m neozve, tak to nen&#xED; moc z&#xE1;bavn&#xE9;. Zvolte si server s hr&#xE1;&#x10D;i, kte&#x159;&#xED; jsou otev&#x159;en&#xED; k nov&#xFD;m p&#x159;&#xE1;tel&#x16F;m a r&#xE1;di s v&#xE1;mi budou hr&#xE1;t a komunikovat.</p><p>Pokud se chyst&#xE1;te hr&#xE1;t s p&#x159;&#xE1;teli, je dobr&#xE9; zvolit server s n&#xED;zkou latenc&#xED; a stabiln&#xED;m p&#x159;ipojen&#xED;m, abyste mohli hr&#xE1;t bez lag&#x16F; a p&#x159;eru&#x161;en&#xED;. Nakonec se ujist&#x11B;te, &#x17E;e server m&#xE1; dostate&#x10D;n&#xE9; zabezpe&#x10D;en&#xED; a spr&#xE1;vu. Server by m&#x11B;l m&#xED;t aktivn&#xED; administr&#xE1;tory, kte&#x159;&#xED; dohl&#xED;&#x17E;&#xED; na chov&#xE1;n&#xED; hr&#xE1;&#x10D;&#x16F; a ochra&#x148;uje server p&#x159;ed cheatery a podvodn&#xED;ky.</p><p>Jakmile si vyberete sv&#x16F;j ide&#xE1;ln&#xED; Minecraft server pro hran&#xED; s p&#x159;&#xE1;teli, m&#x16F;&#x17E;ete se pustit do hran&#xED; a u&#x17E;&#xED;vat si spole&#x10D;nou z&#xE1;bavu. Pamatujte si v&#x161;ak, &#x17E;e ka&#x17E;d&#xFD; server je jin&#xFD; a m&#x16F;&#x17E;e m&#xED;t r&#x16F;zn&#xE1; pravidla a po&#x17E;adavky. Pokud se nejedn&#xE1; o server, kter&#xFD; v&#xE1;s pln&#x11B; uspokojuje, nev&#xE1;hejte si naj&#xED;t jin&#xFD;. V&#x17E;dy existuje mnoho r&#x16F;zn&#xFD;ch mo&#x17E;nost&#xED;, a proto si m&#x16F;&#x17E;ete naj&#xED;t ten spr&#xE1;vn&#xFD; server, kter&#xFD; v&#xE1;m nab&#xED;dne z&#xE1;bavu, kterou hled&#xE1;te.</p><p>Vyb&#xED;r&#xE1;n&#xED; spr&#xE1;vn&#xE9;ho Minecraft serveru m&#x16F;&#x17E;e b&#xFD;t n&#xE1;ro&#x10D;n&#xE9;, ale d&#x16F;le&#x17E;it&#xE9; je, aby se v&#xE1;m na serveru l&#xED;bilo a aby v&#xE1;m poskytovalo p&#x159;esn&#x11B; to, co hled&#xE1;te. Pokud si chcete b&#xFD;t jisti, &#x17E;e jste na&#x161;li ten spr&#xE1;vn&#xFD; server, m&#x16F;&#x17E;ete se pod&#xED;vat na hodnocen&#xED; server&#x16F; na <a href="https://mcservery.eu/servers.php?ref=localhost">server listech</a> nebo na soci&#xE1;ln&#xED;ch s&#xED;t&#xED;ch. Tyto platformy v&#xE1;m mohou poskytnout u&#x17E;ite&#x10D;n&#xE9; informace o serverech, jako jsou recenze a n&#xE1;zory ostatn&#xED;ch hr&#xE1;&#x10D;&#x16F;.</p><p>Nem&#x11B;jte obavy experimentovat s r&#x16F;zn&#xFD;mi servery a vyzkou&#x161;et r&#x16F;zn&#xE9; hern&#xED; m&#xF3;dy. Ka&#x17E;d&#xFD; server je unik&#xE1;tn&#xED; a m&#x16F;&#x17E;e v&#xE1;m nab&#xED;dnout n&#x11B;co nov&#xE9;ho. Pamatujte si, &#x17E;e Minecraft je hra, kter&#xE1; je z&#xE1;bavn&#xE1;, kdy&#x17E; ji hrajete s p&#x159;&#xE1;teli, a &#x17E;e v&#xFD;b&#x11B;r spr&#xE1;vn&#xE9;ho serveru m&#x16F;&#x17E;e b&#xFD;t kl&#xED;&#x10D;ov&#xFD; pro va&#x161;e hern&#xED; z&#xE1;&#x17E;itky.</p>]]></content:encoded></item><item><title><![CDATA[Raspberry Pi 4 Minecraft server s Dockerem a ngrok - Bez potřeby veřejné IP adresy]]></title><description><![CDATA[<p><strong>V tomto &#x10D;l&#xE1;nku se dozv&#xED;te, jak vytvo&#x159;it Minecraft server na Raspberry Pi 4 bez pot&#x159;eby nastavovat port forwarding na va&#x161;em routeru a vlastnit ve&#x159;ejnou ip adresu. M&#xED;sto toho pou&#x17E;ijeme <a href="https://ngrok.com/?ref=localhost">ngrok</a> k vytvo&#x159;</strong></p>]]></description><link>http://localhost:2368/raspberry-pi-4-minecraft-server-s-dockerem-a-ngrok-bez-potreby-verejne-ip-adresy/</link><guid isPermaLink="false">642c25f3b77c2c62c0ab86a9</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Tue, 04 Apr 2023 16:01:44 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1552283576-3ea3519bf12e?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDV8fHJhc3BiZXJyeSUyMFBpfGVufDB8fHx8MTY4MDYxNDgyNg&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1552283576-3ea3519bf12e?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDV8fHJhc3BiZXJyeSUyMFBpfGVufDB8fHx8MTY4MDYxNDgyNg&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Raspberry Pi 4 Minecraft server s Dockerem a ngrok - Bez pot&#x159;eby ve&#x159;ejn&#xE9; IP adresy"><p><strong>V tomto &#x10D;l&#xE1;nku se dozv&#xED;te, jak vytvo&#x159;it Minecraft server na Raspberry Pi 4 bez pot&#x159;eby nastavovat port forwarding na va&#x161;em routeru a vlastnit ve&#x159;ejnou ip adresu. M&#xED;sto toho pou&#x17E;ijeme <a href="https://ngrok.com/?ref=localhost">ngrok</a> k vytvo&#x159;en&#xED; bezpe&#x10D;n&#xE9;ho tunelu pro p&#x159;ipojen&#xED; z internetu.</strong></p><p>Na rozd&#xED;l od jin&#xFD;ch mo&#x17E;nost&#xED;, jak hostovat v&#xE1;&#x161; Minecraft server a&#x165; u&#x17E; pomoc&#xED; AWS nebo klasick&#xE9;ho server hostingu se m&#x16F;&#x17E;e jednat o tu z dlouhodob&#xE9;ho hlediska nejlevn&#x11B;j&#x161;&#xED; metodu. To plat&#xED; p&#x159;edev&#x161;&#xED;m pokud ji&#x17E; doma m&#xE1;te nevyu&#x17E;&#xED;van&#xE9; Raspberry Pi nebo pl&#xE1;nujete provozovat men&#x161;&#xED; server dlouhodob&#x11B;. Poj&#x10F;me se pod&#xED;vat jak na to.</p><h2 id="co-budeme-pot%C5%99ebovat">Co budeme pot&#x159;ebovat:</h2><ul><li>Po&#x10D;&#xED;ta&#x10D; se syst&#xE9;mem Windows, Mac nebo Linux.</li><li>Raspberry pi 4 (doporu&#x10D;uje se alespo&#x148; model s 2GB, z&#xE1;le&#x17E;&#xED; v&#x161;ak na tom, kolik lid&#xED; bude na serveru hr&#xE1;t).</li><li>16GB nebo v&#x11B;t&#x161;&#xED; micro sd kartu.</li><li>Ethernetov&#xFD; kabel.</li><li>Nap&#xE1;jec&#xED; adapt&#xE9;r pro Pi</li></ul><p>Nejprve nainstalujte opera&#x10D;n&#xED; syst&#xE9;m na Va&#x161;e Raspberry Pi. K tomu budeme pot&#x159;ebovat st&#xE1;hnout ofici&#xE1;ln&#xED; <a href="https://www.raspberrypi.com/software/?ref=localhost">Raspberry Pi Imager</a>.</p><figure class="kg-card kg-image-card"><img src="http://localhost:2368/content/images/2023/04/image-11.png" class="kg-image" alt="Raspberry Pi 4 Minecraft server s Dockerem a ngrok - Bez pot&#x159;eby ve&#x159;ejn&#xE9; IP adresy" loading="lazy" width="945" height="623" srcset="http://localhost:2368/content/images/size/w600/2023/04/image-11.png 600w, http://localhost:2368/content/images/2023/04/image-11.png 945w" sizes="(min-width: 720px) 720px"></figure><p>P&#x159;ipojte k po&#x10D;&#xED;ta&#x10D;i SD kartu. Zvolte opera&#x10D;n&#xED; syst&#xE9;m, kter&#xFD; chcete nainstalovat, vyberte spr&#xE1;vnou SD kartu, kterou jste p&#x159;ipojili (ujist&#x11B;te se, &#x17E;e je to ta spr&#xE1;vn&#xE1;!), a pot&#xE9; stiskn&#x11B;te tla&#x10D;&#xED;tko pro z&#xE1;pis. Nechte proces z&#xE1;pisu dokon&#x10D;it a ignorujte v&#x161;echna okna Pr&#x16F;zkumn&#xED;ka soubor&#x16F;, kter&#xE1; se mohou objevit.</p><p>Pro tento tutori&#xE1;l zvol&#xED;m verzi Raspberry Pi OS lite 32-bit. Verze lite neobsahuje desktopov&#xE9; prost&#x159;ed&#xED;, co&#x17E; pro &#xFA;&#x10D;ely tohoto n&#xE1;vodu nen&#xED; pot&#x159;eba, ale pokud chcete, m&#x16F;&#x17E;ete si nainstalovat verzi s desktopov&#xFD;m prost&#x159;ed&#xED;m. Pokud m&#xE1;te model Raspberry Pi s kapacitou 8GB, vyberte 64-bitovou verzi OS, abyste mohli pln&#x11B; vyu&#x17E;&#xED;t potenci&#xE1;lu RAM va&#x161;eho Raspberry Pi.</p><!--kg-card-begin: markdown--><p>Jakmile m&#xE1;te obraz syst&#xE9;mu hotov&#xFD;, ignorujte p&#x159;&#xED;padn&#xE9; varov&#xE1;n&#xED; syst&#xE9;mu Windows, kter&#xE9; se m&#x16F;&#x17E;e objevit a tvrdit, &#x17E;e je pot&#x159;eba disk s nov&#xFD;m syst&#xE9;mem naform&#xE1;tovat. Vyt&#xE1;hn&#x11B;te a znovu p&#x159;ipojte SD kartu k po&#x10D;&#xED;ta&#x10D;i, otev&#x159;ete disk ozna&#x10D;en&#xFD; jako &quot;boot&quot; a vytvo&#x159;te na kart&#x11B; soubor nazvan&#xFD; &quot;ssh&quot; (bez p&#x159;&#xED;pony). U Windows to lze ud&#x11B;lat vytvo&#x159;en&#xED;m textov&#xE9;ho souboru a odstran&#x11B;n&#xED;m p&#x159;&#xED;pony .txt. Pokud pou&#x17E;&#xED;v&#xE1;te Mac nebo Linux sta&#x10D;&#xED; ve slo&#x17E;ce boot otev&#x159;&#xED;t termin&#xE1;l a pou&#x17E;&#xED;t p&#x159;&#xED;kaz: <code>touch ssh</code></p>
<!--kg-card-end: markdown--><p>Vlo&#x17E;te kartu SD do Raspberry Pi, p&#x159;ipojte Ethernetov&#xFD; a nap&#xE1;jec&#xED; kabel. Po&#x10D;kejte minutu na spu&#x161;t&#x11B;n&#xED; a nalezen&#xED; IP adresy. M&#x16F;&#x17E;ete zjistit IP adresu t&#xED;m, &#x17E;e nav&#x161;t&#xED;v&#xED;te webov&#xE9; rozhran&#xED; va&#x161;eho routeru. Pokud nev&#xED;te, jak naj&#xED;t IP adresu va&#x161;eho routeru, doporu&#x10D;uji tento vynikaj&#xED;c&#xED; <a href="https://www.pcmag.com/how-to/how-to-access-your-wi-fi-routers-settings?ref=localhost">&#x10D;l&#xE1;nek</a>. Jakmile se &#xFA;sp&#x11B;&#x161;n&#x11B; p&#x159;ihl&#xE1;s&#xED;te ke sv&#xE9;mu routeru, zkontrolujte p&#x159;ipojen&#xE1; za&#x159;&#xED;zen&#xED;.</p><!--kg-card-begin: markdown--><p>Jakmile z&#xED;sk&#xE1;te IP adresu Raspberry Pi, p&#x159;ipojte se k n&#x11B;mu pomoc&#xED; protokolu SSH. Pokud pou&#x17E;&#xED;v&#xE1;te opera&#x10D;n&#xED; syst&#xE9;m Mac nebo Linux, m&#x16F;&#x17E;ete pou&#x17E;&#xED;t n&#xE1;sleduj&#xED;c&#xED; p&#x159;&#xED;kaz z termin&#xE1;lu: <code>ssh pi@&lt;ip-adresa&gt;</code>, kde <ip-adresa> je IP adresa Raspberry Pi. Pokud pou&#x17E;&#xED;v&#xE1;te syst&#xE9;m Windows, m&#x16F;&#x17E;ete pou&#x17E;&#xED;t software jako Putty, vlo&#x17E;it IP adresu Raspberry Pi do pole &quot;Adresa&quot; a kliknout na tla&#x10D;&#xED;tko &quot;P&#x159;ipojit&quot;.</ip-adresa></p>
<!--kg-card-end: markdown--><p>V&#xFD;choz&#xED; heslo je &quot;raspberry&quot;. Okam&#x17E;it&#x11B; po p&#x159;ihl&#xE1;&#x161;en&#xED; zm&#x11B;&#x148;te v&#xFD;choz&#xED; heslo zad&#xE1;n&#xED;m p&#x159;&#xED;kazu passwd a n&#xE1;sledov&#xE1;n&#xED;m pokyn&#x16F;.</p><p>Nyn&#xED; aktualizujte Raspberry Pi p&#x159;&#xED;kazy sudo apt update &amp;&amp; sudo apt upgrade. Toto m&#x16F;&#x17E;e trvat n&#x11B;kolik minut. Po dokon&#x10D;en&#xED; aktualizace restartujte Raspberry Pi pomoc&#xED; p&#x159;&#xED;kazu sudo reboot now a po&#x10D;kejte minutu na jeho op&#x11B;tovn&#xE9; spu&#x161;t&#x11B;n&#xED;. Po op&#x11B;tovn&#xE9;m p&#x159;ipojen&#xED; se m&#x16F;&#x17E;ete p&#x159;esunout na dal&#x161;&#xED; krok.</p><h2 id="instalace-pot%C5%99ebn%C3%BDch-bal%C3%AD%C4%8Dk%C5%AF">Instalace pot&#x159;ebn&#xFD;ch bal&#xED;&#x10D;k&#x16F;</h2><p>Nyn&#xED; kdy&#x17E; ji&#x17E; m&#xE1;me nakonfigurovan&#xE9; Raspberry Pi m&#x16F;&#x17E;eme pokra&#x10D;ovat d&#xE1;l a nainstalovat samotn&#xE1; Minecraft server. K tomu pou&#x17E;ijeme tento <a href="https://github.com/itzg/docker-minecraft-server?ref=localhost">Docker image</a> k sestaven&#xED; na&#x161;eho serveru. Stejn&#xFD; Docker image m&#x16F;&#x17E;ete pou&#x17E;&#xED;t i pokud byste instalovali V&#xE1;&#x161; server nap&#x159;&#xED;klad na AWS.</p><p>Budeme pot&#x159;eba nainstalovat p&#xE1;r v&#x11B;c&#xED;. Celkov&#x11B; to bude trvat p&#x159;ibli&#x17E;n&#x11B; 15 minut v z&#xE1;vislosti na va&#x161;em internetov&#xE9;m p&#x159;ipojen&#xED;.</p><!--kg-card-begin: html--><p>Nainstalujte javu p&#x159;&#xED;kazem: <code>sudo apt install default-jdk</code></p>

<p>St&#xE1;hn&#x11B;te a nainstalujte libseccomp2:</p>
<code>wget http://ftp.de.debian.org/debian/pool/main/libs/libseccomp/libseccomp2_2.4.4-1~bpo10+1_armhf.deb</code>

<p>Pot&#xE9; nainstalujte sta&#x17E;en&#xFD; soubor: <code>sudo dpkg -i libseccomp2_2.5.1-1~bpo10+1_armhf.deb</code></p><!--kg-card-end: html--><p>Toto je nejaktu&#xE1;ln&#x11B;j&#x161;&#xED; verze v dob&#x11B; psan&#xED; tohoto tutori&#xE1;lu. M&#x16F;&#x17E;ete ov&#x11B;&#x159;it nejnov&#x11B;j&#x161;&#xED; verzi a odkazy na zrcadla pomoc&#xED; tohoto odkazu: <a href="https://packages.debian.org/buster-backports/libseccomp2?ref=localhost">https://packages.debian.org/buster-backports/libseccomp2</a></p><p>Nakonec pot&#x159;ebujeme samotn&#xFD; Docker a pro to spus&#x165;te n&#xE1;sleduj&#xED;c&#xED; p&#x159;&#xED;kazy postupn&#x11B; jeden po druh&#xE9;m:</p><!--kg-card-begin: html--><ul>
    <li><code>curl -fsSL https://get.docker.com -o get-docker.sh</code></li>
    <li><code>sh ./get-docker.sh</code></li>
    <li><code>sudo apt-get install -y libffi-dev libssl-dev python3 python3-pip</code></li>
    <li><code>sudo apt-get remove python-configparser</code></li>
    <li><code>sudo pip3 -v install docker-compose</code></li>
</ul><!--kg-card-end: html--><p>P&#x159;i&#x159;a&#x10F;te opr&#xE1;vn&#x11B;n&#xED; u&#x17E;ivateli pi ke spu&#x161;t&#x11B;n&#xED; p&#x159;&#xED;kaz&#x16F; dockeru:</p><!--kg-card-begin: html--><code>sudo usermod -aG docker pi</code><!--kg-card-end: html--><!--kg-card-begin: html--><p>Pot&#xE9; restartujte Raspberry Pi (<code>sudo reboot now</code>) a p&#x159;ihlaste se znovu. Nyn&#xED; bychom m&#x11B;li b&#xFD;t p&#x159;ipraveni nastavit server.</p><!--kg-card-end: html--><h2 id="spu%C5%A1t%C4%9Bn%C3%AD-serveru">Spu&#x161;t&#x11B;n&#xED; serveru</h2><p>Nejprve vytvo&#x159;te adres&#xE1;&#x159; pro Minecraft server a pomoc&#xED; p&#x159;&#xED;kazu cd do n&#x11B;j p&#x159;ejd&#x11B;te:</p><!--kg-card-begin: html--><code>mkdir minecraft-server &amp;&amp; cd minecraft-server</code>
<p>Vytvo&#x159;te soubor docker-compose.yml: <code>sudo nano docker-compose.yml</code></p>

<p>Do souboru zkop&#xED;rujte n&#xE1;sleduj&#xED;c&#xED; obsah:
    <pre>
    minecraft-server:
    image: itzg/minecraft-server
    container_name: minecraft-server

    ports:
        - &quot;25565:25565&quot;

    environment:
        MEMORY: 1G
        EULA: &quot;TRUE&quot;
    tty: true
    stdin_open: true
    restart: always

    volumes:
        # attach a directory relative to the directory containing this compose file
        - ./minecraft-data:/data
    </pre>
</p><!--kg-card-end: html--><p>M&#x11B;jte na pam&#x11B;ti, &#x17E;e t&#xED;mto souhlas&#xED;te s licen&#x10D;n&#xED;mi podm&#xED;nkami Minecraftu. Pro ukon&#x10D;en&#xED; souboru stiskn&#x11B;te ctrl+x, pot&#xE9; y a enter.</p><p>Pokud chcete vid&#x11B;t, jak&#xE9; dal&#x161;&#xED; mo&#x17E;nosti a parametry m&#x16F;&#x17E;ete pou&#x17E;&#xED;t, pod&#xED;vejte se na repozit&#xE1;&#x159; na <a href="https://github.com/itzg/docker-minecraft-server?ref=localhost">Githubu</a>. Jsou tam mo&#x17E;nosti, jak spustit i jin&#xFD; druh Minecraft serveru (Bukkit/Spigot, Paper a mnoho dal&#x161;&#xED;ch).</p><p>Docker-compose.yml soubor, kter&#xFD; jsme pr&#xE1;v&#x11B; vytvo&#x159;ili, &#x159;&#xED;k&#xE1; Dockeru, jak a jak&#xFD; obraz postavit. Prvn&#xED; &#x159;&#xE1;dek ud&#xE1;v&#xE1; n&#xE1;zev kontejneru, kter&#xFD; m&#x16F;&#x17E;e b&#xFD;t cokoliv, ale my jsme zvolili minecraft-server, aby byl snadno identifikovateln&#xFD;. Tento n&#xE1;zev je tak&#xE9; znovu specifikov&#xE1;n na &#x159;&#xE1;dku 3. Dal&#x161;&#xED; d&#x16F;le&#x17E;it&#xE9; parametry jsou MEMORY pod environment a sekce volumes.</p><p>Pam&#x11B;&#x165; je nastavena na 1 gigabyte, ale m&#x16F;&#x17E;ete ji zm&#x11B;nit, nap&#x159;&#xED;klad t&#xED;m, &#x17E;e nam&#xED;sto 1G nap&#xED;&#x161;ete 2G. Ujist&#x11B;te se v&#x161;ak, &#x17E;e je ni&#x17E;&#x161;&#xED; ne&#x17E; celkov&#xE1; pam&#x11B;&#x165; va&#x161;eho Raspberry.</p><!--kg-card-begin: markdown--><p>Pro spu&#x161;t&#x11B;n&#xED; serveru sta&#x10D;&#xED; zadat p&#x159;&#xED;kaz <code>docker-compose up -d</code>. Docker pot&#xE9; st&#xE1;hne soubory obrazu a spust&#xED; kontejner. Jakmile se dokon&#x10D;&#xED; stahov&#xE1;n&#xED;, m&#x16F;&#x17E;ete zkontrolovat stav sv&#xE9;ho Docker kontejneru pomoc&#xED; p&#x159;&#xED;kazu <code>docker logs -f minecraft-server</code>. Pokud vid&#xED;te startovac&#xED; protokol minecraft serveru, funguje to! Pro ukon&#x10D;en&#xED; zobrazen&#xED; protokolu pou&#x17E;ijte kl&#xE1;vesovou zkratku ctrl+c.</p>
<p>Tak&#xE9; zjist&#xED;te, &#x17E;e byla vytvo&#x159;ena slo&#x17E;ka s n&#xE1;zvem <code>minecraft-data</code>. Toto je um&#xED;st&#x11B;n&#xED; va&#x161;ich konfigura&#x10D;n&#xED;ch soubor&#x16F; serveru.</p>
<p>Pro ov&#x11B;&#x159;en&#xED;, zda se k serveru m&#x16F;&#x17E;ete p&#x159;ipojit, otev&#x159;ete aplikaci minecraft a do pole pro p&#x159;id&#xE1;n&#xED; nov&#xE9;ho serveru zadejte IP adresu va&#x161;eho raspberry pi. Pokud se server objev&#xED; v seznamu, funguje to jak m&#xE1;!</p>
<p>Zp&#x159;&#xED;stupn&#x11B;n&#xED; Va&#x161;eho serveru mimo lok&#xE1;ln&#xED; s&#xED;&#x165;<br>
Nejprve budete pot&#x159;ebovat &#xFA;&#x10D;et pro pou&#x17E;it&#xED; ngrok. Zaregistrujte se <a href="https://ngrok.com/?ref=localhost">zde</a>.</p>
<p>Jakmile m&#xE1;te &#xFA;&#x10D;et, vra&#x165;te se zp&#x11B;t na obrazovku Raspberry Pi, a p&#x159;ejd&#x11B;te se zp&#x11B;t do domovsk&#xE9;ho adres&#xE1;&#x159;e pomoc&#xED; p&#x159;&#xED;kazu <code>cd ~</code> a pot&#xE9; st&#xE1;hn&#x11B;te a rozbalte ngrok pomoc&#xED; n&#xE1;sleduj&#xED;c&#xED;ch p&#x159;&#xED;kaz&#x16F;:</p>
<pre><code>wget https://bin.equinox.io/c/4VmDzA7iaHb/ngrok-stable-linux-arm.tgz
tar -xvzf ngrok-stable-linux-arm.tgz
</code></pre>
<p>Ov&#x11B;&#x159;te, zda je nainstalov&#xE1;n, zad&#xE1;n&#xED;m p&#x159;&#xED;kazu <code>./ngrok help</code>. Pokud dostanete seznam p&#x159;&#xED;kaz&#x16F;, kter&#xE9; m&#x16F;&#x17E;ete pou&#x17E;&#xED;t s ngrok, pak byl nainstalov&#xE1;n spr&#xE1;vn&#x11B;.</p>
<p>Nastavte ngrok k pou&#x17E;it&#xED; autentifika&#x10D;n&#xED;ho tokenu, kter&#xFD; jste z&#xED;skali p&#x159;i registraci, pomoc&#xED; n&#xE1;sleduj&#xED;c&#xED;ho p&#x159;&#xED;kazu:<br>
<code>./ngrok authtoken TOKEN</code></p>
<!--kg-card-end: markdown--><p>Token naleznete v ngrok dashboardu po p&#x159;ihl&#xE1;&#x161;en&#xED; do &#xFA;&#x10D;tu. Najdete ho na kart&#x11B; &quot;Auth&quot; nebo p&#x159;ejdete na tuto str&#xE1;nku: <a href="https://dashboard.ngrok.com/get-started/your-authtoken?ref=localhost">https://dashboard.ngrok.com/get-started/your-authtoken</a>.</p><!--kg-card-begin: markdown--><p>Jakmile spust&#xED;te p&#x159;&#xED;kaz, bude vytvo&#x159;en soubor <code>ngrok.yml</code> obsahuj&#xED;c&#xED; v&#xE1;&#x161; token. Pro nastaven&#xED; tunelu budete muset upravit konfigura&#x10D;n&#xED; soubor <code>ngrok.yml</code>, kter&#xFD; byl pr&#xE1;v&#x11B; vytvo&#x159;en. M&#x11B;l by se nach&#xE1;zet n&#x11B;kde jako <code>/home/pi/.ngrok2/ngrok.yml</code>.</p>
<p>Otev&#x159;ete soubor pomoc&#xED; p&#x159;&#xED;kazu nano:<br>
<code>sudo nano /home/pi/.ngrok2/ngrok.yml</code></p>
<!--kg-card-end: markdown--><p>A p&#x159;idejte n&#xE1;sleduj&#xED;c&#xED; k&#xF3;d ZA V&#xE1;&#x161; authtoken:</p><!--kg-card-begin: markdown--><pre><code>tunnels:
  minecraft-server:
    proto: tcp
    addr: 25565
    bind-tls: true
    console_ui: false
</code></pre>
<!--kg-card-end: markdown--><p>Pro opu&#x161;t&#x11B;n&#xED; souboru stiskn&#x11B;te Ctrl + X, pot&#xE9; Y a nakonec Enter.</p><p>T&#xED;mto jste nastavili tunel na pou&#x17E;it&#xED; protokolu TCP, otev&#x159;en&#xFD; na portu 25565, co&#x17E; je port Minecraftu. Tak&#xE9; jste tunelu pojmenovali minecraft-server.</p><p>Te&#x10F; u&#x17E; jen vytvo&#x159;&#xED;te soubor, kter&#xFD; povol&#xED; ngrok jako slu&#x17E;bu, tak&#x17E;e bude spu&#x161;t&#x11B;n p&#x159;i spu&#x161;t&#x11B;n&#xED; Raspberry Pi a nebude se zobrazovat v pop&#x159;ed&#xED;, kdy&#x17E; ngrok b&#x11B;&#x17E;&#xED;.</p><!--kg-card-begin: markdown--><p><code>sudo nano /etc/systemd/system/ngrok-client.service</code></p>
<p>Vlo&#x17E;t&#x11B; n&#xE1;sleduj&#xED;c&#xED; obsah:</p>
<pre><code>[Unit]
Description=ngrok client
After=network.target

[Service]
ExecStart=/home/pi/ngrok start --all -config /home/pi/.ngrok2/ngrok.yml
Restart=on-abort

[Install]
WantedBy=multi-user.target
</code></pre>
<p>Jako v&#x17E;dy stiskn&#x11B;te ctrl+x, n&#xE1;sledov&#xE1;no y a pot&#xE9; enter pro ulo&#x17E;en&#xED; a ukon&#x10D;en&#xED;.</p>
<p>N&#xE1;sleduj&#xED;c&#xED; p&#x159;&#xED;kazy slou&#x17E;&#xED; k povolen&#xED; ngrok jako slu&#x17E;by:</p>
<pre><code>sudo systemctl daemon-reload
sudo systemctl enable ngrok-client
sudo systemctl start ngrok-client
</code></pre>
<p>Pro ov&#x11B;&#x159;en&#xED;, zda ngrok funguje, spus&#x165;te n&#xE1;sleduj&#xED;c&#xED; p&#x159;&#xED;kaz: <code>systemctl status ngrok-client.service</code>. Pokud vid&#xED;te, &#x17E;e je slu&#x17E;ba povolena (enabled), tak funguje spr&#xE1;vn&#x11B;!</p>
<!--kg-card-end: markdown--><p>Pro z&#xED;sk&#xE1;n&#xED; odkazu, kter&#xFD; m&#x16F;&#x17E;ete sd&#xED;let s p&#x159;&#xE1;teli, aby se p&#x159;ipojili k serveru, nav&#x161;tivte str&#xE1;nku stavu ngrok.</p><p>Zde uvid&#xED;te v&#x161;echny sv&#xE9; tunely <a href="https://dashboard.ngrok.com/cloud-edge/endpoints?ref=localhost">https://dashboard.ngrok.com/cloud-edge/endpoints</a></p><p>Odkaz pro tunel m&#xE1; p&#x159;edponu tcp://. P&#x159;i vkl&#xE1;d&#xE1;n&#xED; do adresn&#xED;ho &#x159;&#xE1;dku serveru v Minecraftu je t&#x159;eba tuto p&#x159;edponu odstranit.</p><p><strong>Hotovo! Server b&#x11B;&#x17E;&#xED; a ngrok je nakonfigurov&#xE1;n. M&#x16F;&#x17E;ete se odpojit od ssh relace a u&#x17E;&#xED;vat si Minecraft! Pro aktualizaci serveru na nejnov&#x11B;j&#x161;&#xED; verzi Minecraftu sta&#x10D;&#xED; restartovat Raspberry Pi (pokud jste server nakonfigurovali podle tohoto n&#xE1;vodu). M&#x11B;jte na pam&#x11B;ti, &#x17E;e n&#xE1;zvy ngrok tunel&#x16F; se n&#x11B;kdy m&#x11B;n&#xED;, tak&#x17E;e po ka&#x17E;d&#xE9;m restartu syst&#xE9;mu zkontrolujte str&#xE1;nku stavu ngrok, abyste z&#xED;skali aktualizovanou adresu serveru. Pokud vlastn&#xED;te dom&#xE9;nu, m&#x16F;&#x17E;ete si j&#xED; nastavit jako adresu serveru pomoc&#xED; tohoto <a href="https://ngrok.com/docs/guides/how-to-set-up-a-custom-domain/?ref=localhost">n&#xE1;vodu</a>.</strong></p>]]></content:encoded></item><item><title><![CDATA[Verze: 2.2 Claim serveru a přepracovaný Votifier]]></title><description><![CDATA[<p>Ahoj, dnes byla kone&#x10D;n&#x11B; vyd&#xE1;na velk&#xE1; aktualizace server listu, kter&#xE1; p&#x159;in&#xE1;&#x161;&#xED; mnoho v&#xFD;znamn&#xFD;ch zm&#x11B;n po dlouh&#xE9; dob&#x11B;. Jak jsem sl&#xED;bil p&#x159;i minul&#xE9;m men&#x161;</p>]]></description><link>http://localhost:2368/verze-2-2/</link><guid isPermaLink="false">642b65a5fefb6657bc0d3400</guid><category><![CDATA[Server list]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Tue, 04 Apr 2023 01:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1620121692029-d088224ddc74?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDR8fG1hYyUyMHdhbGxwYXBlcnxlbnwwfHx8fDE2ODA1NjU2NTI&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1620121692029-d088224ddc74?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDR8fG1hYyUyMHdhbGxwYXBlcnxlbnwwfHx8fDE2ODA1NjU2NTI&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Verze: 2.2 Claim serveru a p&#x159;epracovan&#xFD; Votifier"><p>Ahoj, dnes byla kone&#x10D;n&#x11B; vyd&#xE1;na velk&#xE1; aktualizace server listu, kter&#xE1; p&#x159;in&#xE1;&#x161;&#xED; mnoho v&#xFD;znamn&#xFD;ch zm&#x11B;n po dlouh&#xE9; dob&#x11B;. Jak jsem sl&#xED;bil p&#x159;i minul&#xE9;m men&#x161;&#xED;m updatu na za&#x10D;&#xE1;tku tohoto roku, adresy server&#x16F; byly zm&#x11B;n&#x11B;ny podle p&#x159;&#xE1;n&#xED; u&#x17E;ivatel&#x16F;. Ale to nen&#xED; v&#x161;echno! Tuto novou funkci jsem si dr&#x17E;el v tajnosti, ale nyn&#xED; ji mohu kone&#x10D;n&#x11B; odhalit - je mo&#x17E;n&#xE9; p&#x159;ev&#xE9;st vlastnictv&#xED; serveru bez kontaktov&#xE1;n&#xED; podpory. To by m&#x11B;lo usnadnit spr&#xE1;vu server&#x16F; pro na&#x161;e u&#x17E;ivatele. Poj&#x10F;me se tedy pod&#xED;vat na v&#x161;echny dal&#x161;&#xED; &#xFA;pravy.</p><h3 id="%E2%9A%A1%EF%B8%8F-na%C4%8D%C3%ADt%C3%A1n%C3%AD-seznamu-server%C5%AF-bylo-zrychleno-o-70">&#x26A1;&#xFE0F; Na&#x10D;&#xED;t&#xE1;n&#xED; seznamu server&#x16F; bylo zrychleno o 70%</h3><p>Je to zhruba p&#x159;es rok, kdy byla provedena anketa kde jsem se u&#x17E;ivatel&#x16F; ptal, co by na mcservery.eu zlep&#x161;ili. &#x10C;astou odpov&#x11B;d&#xED; byla rychlost. V&#xED;m je to dlouh&#xE1; doba, tato zm&#x11B;na m&#x11B;li p&#x159;ij&#xED;t d&#x159;&#xED;ve. Nicm&#xE9;n&#x11B; seznam server&#x16F; se ji&#x17E; na&#x10D;&#xED;t&#xE1; rychleji, a to v pr&#x16F;m&#x11B;ru o 70 % </p><p>Douf&#xE1;m, &#x17E;e v dohledn&#xE9; dob&#x11B; by se mohlo poda&#x159;it toto na&#x10D;&#xED;t&#xE1;n&#xED; je&#x161;t&#x11B; zrychlit.</p><figure class="kg-card kg-gallery-card kg-width-wide kg-card-hascaption"><div class="kg-gallery-container"><div class="kg-gallery-row"><div class="kg-gallery-image"><img src="http://localhost:2368/content/images/2023/04/Rychlost-pr-ed.png" width="2000" height="1231" loading="lazy" alt="Verze: 2.2 Claim serveru a p&#x159;epracovan&#xFD; Votifier" srcset="http://localhost:2368/content/images/size/w600/2023/04/Rychlost-pr-ed.png 600w, http://localhost:2368/content/images/size/w1000/2023/04/Rychlost-pr-ed.png 1000w, http://localhost:2368/content/images/size/w1600/2023/04/Rychlost-pr-ed.png 1600w, http://localhost:2368/content/images/size/w2400/2023/04/Rychlost-pr-ed.png 2400w" sizes="(min-width: 720px) 720px"></div><div class="kg-gallery-image"><img src="http://localhost:2368/content/images/2023/04/rychlost-po.png" width="2000" height="1231" loading="lazy" alt="Verze: 2.2 Claim serveru a p&#x159;epracovan&#xFD; Votifier" srcset="http://localhost:2368/content/images/size/w600/2023/04/rychlost-po.png 600w, http://localhost:2368/content/images/size/w1000/2023/04/rychlost-po.png 1000w, http://localhost:2368/content/images/size/w1600/2023/04/rychlost-po.png 1600w, http://localhost:2368/content/images/size/w2400/2023/04/rychlost-po.png 2400w" sizes="(min-width: 720px) 720px"></div></div></div><figcaption>P&#x159;ed a po</figcaption></figure><h3 id="%F0%9F%94%97-m%C4%9Bn%C3%AD-se-adresa-str%C3%A1nky-serveru">&#x1F517; M&#x11B;n&#xED; se adresa str&#xE1;nky serveru</h3><p>Dal&#x161;&#xED; dlouho &#x17E;&#xE1;dan&#xE1; novinka, na detail serveru se nov&#x11B; lze dostat pomoc&#xED; nov&#xE9;ho tvaru url adresy. nap&#x159;: <strong>mcservery.eu/server/jmeno-serveru</strong></p><p>doch&#xE1;z&#xED; tak k sjednocen&#xED; stylu odkaz&#x16F;, s ji&#x17E; d&#x159;&#xED;ve zm&#x11B;n&#x11B;n&#xFD;mi url u&#x17E;ivatelsk&#xFD;ch profil&#x16F;.</p><p>P&#x159;&#xED;stup p&#x159;es parametr id prozat&#xED;m z&#x16F;st&#xE1;v&#xE1; st&#xE1;le funk&#x10D;n&#xED;. Bude ale up&#x159;ednostn&#x11B;no pou&#x17E;it&#xED; nov&#xFD;ch adres se jm&#xE9;nem serveru.</p><h3 id="%F0%9F%93%9D-oprava-zobrazen%C3%AD-popis%C5%AF-server%C5%AF">&#x1F4DD; Oprava zobrazen&#xED; popis&#x16F; server&#x16F;</h3><p>Ji&#x17E; d&#x159;&#xED;ve bylo mo&#x17E;n&#xE9; pou&#x17E;it&#xED; markdownu v popisu serveru, bohu&#x17E;el se ale n&#x11B;kter&#xE9; styly nezobrazovali v&#x17E;dy spr&#xE1;vn&#x11B;. Tento probl&#xE9;m by ji&#x17E; m&#x11B;l b&#xFD;t opraven.</p><p>Zm&#x11B;nil jsem k&#xF3;d pro parsov&#xE1;n&#xED; Markdownu, nov&#x11B; tak na mcservery.eu pou&#x17E;&#xED;v&#xE1;me knihovnu <a href="https://showdownjs.com/?ref=localhost">Showdown.js</a> a popisy by se ji&#x17E; m&#x11B;li u v&#x161;ech serveru zobrazovat spr&#xE1;vn&#x11B;, tedy pokud v popisu spr&#xE1;vn&#x11B; pou&#x17E;&#xED;v&#xE1;te Markdown.</p><figure class="kg-card kg-gallery-card kg-width-wide"><div class="kg-gallery-container"><div class="kg-gallery-row"><div class="kg-gallery-image"><img src="http://localhost:2368/content/images/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.04.png" width="2000" height="1195" loading="lazy" alt="Verze: 2.2 Claim serveru a p&#x159;epracovan&#xFD; Votifier" srcset="http://localhost:2368/content/images/size/w600/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.04.png 600w, http://localhost:2368/content/images/size/w1000/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.04.png 1000w, http://localhost:2368/content/images/size/w1600/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.04.png 1600w, http://localhost:2368/content/images/size/w2400/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.04.png 2400w" sizes="(min-width: 720px) 720px"></div><div class="kg-gallery-image"><img src="http://localhost:2368/content/images/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.33.png" width="2000" height="1195" loading="lazy" alt="Verze: 2.2 Claim serveru a p&#x159;epracovan&#xFD; Votifier" srcset="http://localhost:2368/content/images/size/w600/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.33.png 600w, http://localhost:2368/content/images/size/w1000/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.33.png 1000w, http://localhost:2368/content/images/size/w1600/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.33.png 1600w, http://localhost:2368/content/images/size/w2400/2023/04/Sni-mek-obrazovky-2023-04-04-v-2.48.33.png 2400w" sizes="(min-width: 720px) 720px"></div></div></div></figure><p><strong>Je mo&#x17E;n&#xE9; &#x17E;e bude u va&#x161;eho serveru nutn&#xE9; popis upravit, aby se zobrazoval tak jak m&#xE1;.</strong></p><h3 id="%E2%9C%85-ov%C4%9B%C5%99en%C3%BD-server">&#x2705; Ov&#x11B;&#x159;en&#xFD; server</h3><p>Nov&#x11B; se u server&#x16F; kde je p&#x159;id&#xE1;n odkaz na web, a z&#xE1;rove&#x148; m&#xE1;te na Va&#x161;em webu zp&#x11B;tn&#xFD; odkaz na mcservery.eu bude zobrazovat &#x17E;e je v&#xE1;&#x161; server ov&#x11B;&#x159;en&#xFD;.</p><p>Potvrzujeme tak &#x17E;e u&#x17E;ivatel kter&#xFD; p&#x159;idal dan&#xFD; server na server list, m&#xE1; pod kontrolou dom&#xE9;nu kterou uvedl u serveru.</p><p>Propojen&#xE9; dom&#xE9;ny s va&#x161;&#xED;m &#xFA;&#x10D;tem si m&#x16F;&#x17E;ete zkontrolovat tak&#xE9; v nastaven&#xED; u&#x17E;ivatelsk&#xE9;ho &#xFA;&#x10D;tu.</p><figure class="kg-card kg-image-card"><img src="http://localhost:2368/content/images/2023/04/image-8.png" class="kg-image" alt="Verze: 2.2 Claim serveru a p&#x159;epracovan&#xFD; Votifier" loading="lazy" width="2000" height="544" srcset="http://localhost:2368/content/images/size/w600/2023/04/image-8.png 600w, http://localhost:2368/content/images/size/w1000/2023/04/image-8.png 1000w, http://localhost:2368/content/images/size/w1600/2023/04/image-8.png 1600w, http://localhost:2368/content/images/2023/04/image-8.png 2346w" sizes="(min-width: 720px) 720px"></figure><p>V&#xED;ce k ov&#x11B;&#x159;en&#xFD;m server&#x16F;m: <a href="https://help.mcservery.eu/spravci-serveru/zpe-tny-odkaz/overeny-server?ref=localhost">https://help.mcservery.eu/spravci-serveru/zpe-tny-odkaz/overeny-server</a></p><h3 id="%F0%9F%97%B3%EF%B8%8F-upraven%C3%A9-hlasov%C3%A1n%C3%AD-pomoc%C3%AD-votifieru">&#x1F5F3;&#xFE0F; Upraven&#xE9; hlasov&#xE1;n&#xED; pomoc&#xED; Votifieru</h3><p>Hlasov&#xE1;n&#xED; u server&#x16F; s nastaven&#xFD;m odm&#x11B;&#x148;ov&#xE1;n&#xED;m za hlasov&#xE1;n&#xED; je nov&#x11B; u&#x17E;ivatelsky p&#x159;&#xED;v&#x11B;tiv&#x11B;j&#x161;&#xED;. Nick na serveru se upravuje v modalu, z&#xE1;rove&#x148; je defaultn&#x11B; nastaveno u&#x17E;ivatelsk&#xE9; jm&#xE9;no z webu, tak&#x17E;e nen&#xED; nutn&#xE9; vypl&#x148;ovat pokud se shoduje s p&#x159;ezd&#xED;vkou na serveru pro kter&#xFD; hlasujete.</p><p>Z&#xE1;rove&#x148; byla odstran&#x11B;na chyba p&#x159;i editaci serveru, kter&#xE1; mohla zp&#x16F;sobit nefunk&#x10D;n&#xED; propojen&#xED; s Votifierem.</p><h3 id="%F0%9F%94%80-p%C5%99evod-serveru-vynucen%C3%A9-vlastnictv%C3%AD">&#x1F500; P&#x159;evod serveru / vynucen&#xE9; vlastnictv&#xED;</h3><p>Pokud n&#x11B;kdo p&#x159;idal server, kter&#xFD; je V&#xE1;&#x161;, nebo jen chcete p&#x159;ev&#xE9;st sv&#x16F;j server na jin&#xE9;ho u&#x17E;ivatele nov&#x11B; je to mo&#x17E;n&#xE9; bez kontaktov&#xE1;n&#xED; podpory. Jedn&#xE1; se o ov&#x11B;&#x159;en&#xED; p&#x159;evodu vlastnictv&#xED; serveru prost&#x159;ednictv&#xED;m k&#xF3;du v motd serveru. Tuto funkci m&#xE1; mcservery.eu jako jedin&#xFD; server list na CZ/SK sc&#xE9;n&#x11B;.</p><p>K p&#x159;evodu serveru nen&#xED; nutn&#xE1; spolupr&#xE1;ce u&#x17E;ivatele, kter&#xFD; server na server list p&#x159;idal. Je v&#x161;ak nutn&#xE9; m&#xED;t p&#x159;&#xED;stup na FTP nebo m&#xED;t jinou mo&#x17E;nost, jak v administraci Va&#x161;eho hostingu zm&#x11B;nit konfigura&#x10D;n&#xED; soubor serveru.</p><figure class="kg-card kg-image-card kg-width-wide"><img src="http://localhost:2368/content/images/2023/04/acc-claim.png" class="kg-image" alt="Verze: 2.2 Claim serveru a p&#x159;epracovan&#xFD; Votifier" loading="lazy" width="2000" height="1368" srcset="http://localhost:2368/content/images/size/w600/2023/04/acc-claim.png 600w, http://localhost:2368/content/images/size/w1000/2023/04/acc-claim.png 1000w, http://localhost:2368/content/images/size/w1600/2023/04/acc-claim.png 1600w, http://localhost:2368/content/images/2023/04/acc-claim.png 2000w" sizes="(min-width: 1200px) 1200px"></figure><p>V&#xED;ce k p&#x159;evodu serveru: <a href="https://help.mcservery.eu/spravci-serveru/prevod-vlastnictvi-serveru?ref=localhost">https://help.mcservery.eu/spravci-serveru/prevod-vlastnictvi-serveru</a></p><p><strong>Dal&#x161;&#xED; zm&#x11B;ny:</strong></p><ul><li>P&#x159;es tagy na detailn&#xED; str&#xE1;nce serveru se nov&#x11B; d&#xE1; prokliknout na ostatn&#xED; servery se stejn&#xFD;mi tagy.</li><li>Drobn&#xE9; &#xFA;pravy vzhledu str&#xE1;nek.</li><li>Odkaz z editace serveru zp&#x11B;t na str&#xE1;nku serveru.</li><li>Mo&#x17E;nost kop&#xED;rovat IP adresu serveru do schr&#xE1;nky po kliknut&#xED; (zat&#xED;m jen na detailu serveru).</li><li>Op&#x11B;t p&#x159;epracovan&#xFD; blog. Po 4x BTW &#x1F92F;</li><li>Oprava sitemap. Ji&#x17E; se znovu automaticky generuje.</li></ul><p><strong>A to je pro zat&#xED;m v&#x161;e, v p&#x159;&#xED;pad&#x11B; &#x17E;e by v&#xE1;m cokoliv nefungovalo nebo m&#xE1;te n&#x11B;jak&#xFD; n&#xE1;pad, jak zlep&#x161;it mcservery.eu nev&#xE1;hejte se p&#x159;idat na n&#xE1;&#x161; <a href="https://discord.mcservery.eu/?ref=localhost">Discord server.</a> T&#x11B;&#x161;&#xED;m se na va&#x161;e p&#x159;ipom&#xED;nky a n&#xE1;pady jak tento projekt d&#xE1;l posouvat.</strong></p>]]></content:encoded></item><item><title><![CDATA[Uživatelské rozhraní nastavení účtu a další novinky verze 2.1]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>Ahoj, b&#x11B;hem dne&#x161;n&#xED; noci byla nasazena nov&#xE1; verze webu (2.1). Zde jsem si p&#x159;ipravil kr&#xE1;tk&#xFD; souhrn novinek.</p>
<h2 id="%E2%9A%99%EF%B8%8F-sjednocen%C3%AD-vzhledu-nastaven%C3%AD-%C3%BA%C4%8Dtu">&#x2699;&#xFE0F; Sjednocen&#xED; vzhledu nastaven&#xED; &#xFA;&#x10D;tu</h2>
<p>Vzhled nastaven&#xED; u&#x17E;ivatelsk&#xE9;ho &#xFA;&#x10D;tu</p>]]></description><link>http://localhost:2368/uzivatelske-rozhrani-nastaveni-uctu-a-dalsi-novinky-verze-2-1/</link><guid isPermaLink="false">642b2b91fefb6657bc0d33ca</guid><category><![CDATA[Server list]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Sat, 11 Feb 2023 20:41:00 GMT</pubDate><content:encoded><![CDATA[<!--kg-card-begin: markdown--><p>Ahoj, b&#x11B;hem dne&#x161;n&#xED; noci byla nasazena nov&#xE1; verze webu (2.1). Zde jsem si p&#x159;ipravil kr&#xE1;tk&#xFD; souhrn novinek.</p>
<h2 id="%E2%9A%99%EF%B8%8F-sjednocen%C3%AD-vzhledu-nastaven%C3%AD-%C3%BA%C4%8Dtu">&#x2699;&#xFE0F; Sjednocen&#xED; vzhledu nastaven&#xED; &#xFA;&#x10D;tu</h2>
<p>Vzhled nastaven&#xED; u&#x17E;ivatelsk&#xE9;ho &#xFA;&#x10D;tu byl kompletn&#x11B; p&#x159;ed&#x11B;l&#xE1;n. Str&#xE1;nka pro propojen&#xED; &#xFA;&#x10D;tu s Discordem byla integrov&#xE1;na do nov&#xE9; sekce nastaven&#xED;, stejn&#x11B; tak i zm&#x11B;na hesla.<br>
Tato zm&#x11B;na by m&#x11B;la zjednodu&#x161;it a zp&#x159;ehlednit mo&#x17E;nosti nastaven&#xED; pro u&#x17E;ivatele.</p>
<h2 id="%F0%9F%99%8B-zm%C4%9Bna-v-adrese-u%C5%BEivatelsk%C3%A9ho-%C3%BA%C4%8Dtu">&#x1F64B; Zm&#x11B;na v adrese u&#x17E;ivatelsk&#xE9;ho &#xFA;&#x10D;tu</h2>
<p>U&#x17E;ivatelsk&#xE9; &#xFA;&#x10D;ty maj&#xED; nov&#x11B; adresu ve tvaru mcservery.eu/users/JMENO</p>
<p>Tato zm&#x11B;na se do budoucna bude t&#xFD;kat i adres server&#x16F;.</p>
<h2 id="%F0%9F%AA%9B-%C3%BAprava-datab%C3%A1ze">&#x1FA9B; &#xDA;prava datab&#xE1;ze</h2>
<p>Do&#x161;lo ke zm&#x11B;n&#xE1;m jak v samotn&#xE9; datab&#xE1;zi, tak v k&#xF3;du. Nyn&#xED; se server list na&#x10D;&#xED;t&#xE1; o n&#x11B;co rychleji.<br>
Do budoucna pl&#xE1;nuji je&#x161;t&#x11B; dal&#x161;&#xED; &#xFA;pravy, aby byl web rychlej&#x161;&#xED;.</p>
<p>To jsou hlavn&#xED; zm&#x11B;ny posledn&#xED;ho updatu. Do budoucna jsou v pl&#xE1;nu dal&#x161;&#xED; &#xFA;pravy, aby se web na&#x10D;&#xED;tal rychleji. Tak&#xE9; je v pl&#xE1;nu syst&#xE9;m notifikac&#xED; a p&#xE1;r drobn&#xFD;ch &#xFA;prav Discord bota.</p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[MCStats - způsob, jak analyzovat Váš Minecraft server.]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>Vybudovat komunitu na Minecraft serveru m&#x16F;&#x17E;e b&#xFD;t t&#x11B;&#x17E;k&#xE9;, s&#xE1;m jsem p&#x159;ed p&#xE1;r lety spravoval vlastn&#xED; Minecraft server. Nem&#x11B;l jsem pon&#x11B;t&#xED;, odkud hr&#xE1;&#x10D;i p&#x159;i&#x161;</p>]]></description><link>http://localhost:2368/mcstats-zpusob-jak-analyzovat-vas-minecrat-server/</link><guid isPermaLink="false">642b2a72fefb6657bc0d33ba</guid><category><![CDATA[Server list]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Tue, 20 Dec 2022 23:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1451187580459-43490279c0fa?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEyfHxzZXJ2ZXJ8ZW58MHx8fHwxNjgwNTUwNjMw&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<!--kg-card-begin: markdown--><img src="https://images.unsplash.com/photo-1451187580459-43490279c0fa?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEyfHxzZXJ2ZXJ8ZW58MHx8fHwxNjgwNTUwNjMw&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="MCStats - zp&#x16F;sob, jak analyzovat V&#xE1;&#x161; Minecraft server."><p>Vybudovat komunitu na Minecraft serveru m&#x16F;&#x17E;e b&#xFD;t t&#x11B;&#x17E;k&#xE9;, s&#xE1;m jsem p&#x159;ed p&#xE1;r lety spravoval vlastn&#xED; Minecraft server. Nem&#x11B;l jsem pon&#x11B;t&#xED;, odkud hr&#xE1;&#x10D;i p&#x159;i&#x161;li nebo jak dlouho na serveru z&#x16F;stali.</p>
<p>Tento probl&#xE9;m ale ji&#x17E; nen&#xED; pro spr&#xE1;vce Minecraft server&#x16F; ne&#x159;e&#x161;iteln&#xFD;, z t&#x11B;chto d&#x16F;vod&#x16F; vznik&#xE1; MCStats. Nov&#xFD; projekt pod server listem mcservery.eu.</p>
<p>MCStats si klade za c&#xED;l pomoci provozovatel&#x16F;m Minecraft server&#x16F; l&#xE9;pe porozum&#x11B;t pot&#x159;eb&#xE1;m jejich hr&#xE1;&#x10D;&#x16F; a pomoci s r&#x16F;stem serveru. Jak toho chci dos&#xE1;hnout? Nap&#x159;&#xED;klad um&#xED; v &#x10D;as hl&#xE1;sit v&#xFD;padky serveru a tak&#xE9; je monitorovat zp&#x11B;tn&#x11B;, to umo&#x17E;&#x148;uje vyhodnotit o kolik hr&#xE1;&#x10D;&#x16F; p&#x159;ijde po op&#x11B;tovn&#xE9;m zprovozn&#x11B;n&#xED; serveru. Do budoucna by tak s v&#x11B;t&#x161;&#xED;m monitorovan&#xFD;m vzorkem server&#x16F; mohl syst&#xE9;m um&#x11B;t doporu&#x10D;it vhodn&#xFD; hosting pro V&#xE1;&#x161; server tak aby byl uptime serveru ide&#xE1;ln&#x11B; co nejvy&#x161;&#x161;&#xED;.</p>
<p><img src="https://mcservery.eu/stats/images/stats-screen-main-desktop.png" alt="MCStats - zp&#x16F;sob, jak analyzovat V&#xE1;&#x161; Minecraft server." loading="lazy"></p>
<p>Nespornou v&#xFD;hodou je snadn&#xE1; instalace a fakt &#x17E;e funguje s Va&#x161;&#xED;m obl&#xED;ben&#xFD;m serverov&#xFD;m softwarem. Pro monitoring serveru nen&#xED; zapot&#x159;eb&#xED; instalace &#x17E;&#xE1;dn&#xFD;ch plugin&#x16F;, jedin&#xE9;, co ke sv&#xE9; funkci syst&#xE9;m pot&#x159;ebuje je ip adresa a port serveru.</p>
<p>Co MCStats um&#xED;?</p>
<ul>
<li>Detailn&#xED; statistiky (Po&#x10D;et hr&#xE1;&#x10D;&#x16F;, uptime a podobn&#x11B;...)</li>
<li>Notifikace v p&#x159;&#xED;pad&#x11B; v&#xFD;padku</li>
<li>Vlastn&#xED; status str&#xE1;nka, kterou m&#x16F;&#x17E;ete sd&#xED;let s va&#x161;imi hr&#xE1;&#x10D;i.</li>
<li>Export dat pro dal&#x161;&#xED; pr&#xE1;ci s nimi v csv form&#xE1;tu.</li>
<li>Snadn&#xE1; instalace a &#x161;irok&#xE1; podpora serverov&#xE9;ho softwaru</li>
</ul>
<p>Do budoucna m&#xE1;m mnoho pl&#xE1;n&#x16F; jak slu&#x17E;bu d&#xE1;le vylep&#x161;ovat.</p>
<p>&#x201E;Kdy&#x17E; jsem mcservery.eu za&#x10D;al p&#x159;ipravovat zp&#x11B;t v roce 2020, cht&#x11B;l jsem vybudovat nejen server list ale komunitu kter&#xE1; bude spojovat hr&#xE1;&#x10D;e s provozovateli Minecraft server&#x16F;. S projektem MCStats si kladu za c&#xED;l d&#xE1;le rozv&#xED;jet mcservery.eu a pomoci spr&#xE1;vc&#x16F;m hern&#xED;ch server&#x16F; l&#xE9;pe porozum&#x11B;t jejich hr&#xE1;&#x10D;&#x16F;m.&#x201C;</p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[2.0 Nový design i funkce]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>Budou tomu ji&#x17E; 2 roky co web <a href="http://mcservery.eu/?ref=localhost">mcservery.eu</a> je na sc&#xE9;n&#x11B; Minecraft server list&#x16F;. Web si ji&#x17E; po t&#xE9; dob&#x11B; zaslou&#x17E;il nov&#xFD; p&#x159;&#xED;v&#x11B;tiv&#x11B;j&#x161;&#xED; design a tak&#xE9; funkce kter&</p>]]></description><link>http://localhost:2368/2-0-novy-design-i-funkce/</link><guid isPermaLink="false">642b2894fefb6657bc0d33a8</guid><category><![CDATA[Server list]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Mon, 06 Jun 2022 22:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1619410283995-43d9134e7656?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEzfHxwcm9ncmFtbWluZ3xlbnwwfHx8fDE2ODA1NTAxMzY&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<!--kg-card-begin: markdown--><img src="https://images.unsplash.com/photo-1619410283995-43d9134e7656?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEzfHxwcm9ncmFtbWluZ3xlbnwwfHx8fDE2ODA1NTAxMzY&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="2.0 Nov&#xFD; design i funkce"><p>Budou tomu ji&#x17E; 2 roky co web <a href="http://mcservery.eu/?ref=localhost">mcservery.eu</a> je na sc&#xE9;n&#x11B; Minecraft server list&#x16F;. Web si ji&#x17E; po t&#xE9; dob&#x11B; zaslou&#x17E;il nov&#xFD; p&#x159;&#xED;v&#x11B;tiv&#x11B;j&#x161;&#xED; design a tak&#xE9; funkce kter&#xE9; zv&#xFD;&#x161;&#xED; u&#x17E;ite&#x10D;nou hodnotu str&#xE1;nek.</p>
<p><img src="https://mcservery.eu/blog/images/2022/07/homepage-new.png" alt="2.0 Nov&#xFD; design i funkce" loading="lazy"></p>
<p>&#xDA;vodn&#xED; str&#xE1;nka v nov&#xE9;m designu.</p>
<h2 id="co-se-zm%C4%9Bnilo-na-webu">Co se zm&#x11B;nilo na webu?</h2>
<p>Krom&#x11B; toho &#x17E;e m&#xE1;me nov&#xFD; design str&#xE1;nek, zam&#x11B;&#x159;il jsem se i na to nejd&#x16F;le&#x17E;it&#x11B;j&#x161;&#xED; a t&#xED;m je u&#x17E;ivatelsk&#xFD; z&#xE1;&#x17E;itek a pou&#x17E;itelnost str&#xE1;nek. Nov&#xE1; verze webu zlep&#x161;uje zobrazen&#xED; server&#x16F; a p&#x159;in&#xE1;&#x161;&#xED; p&#x159;ehledn&#x11B;j&#x161;&#xED; t&#x159;&#xED;d&#x11B;n&#xED;.</p>
<p>Tak&#xE9; byly upraveny u&#x17E;ivatelsk&#xE9; profily a <a href="http://mcservery.eu/?ref=localhost">mcservery.eu</a> by se m&#x11B;lo v&#xED;ce ub&#xED;rat sm&#x11B;rem tvorby komunity okolo &#x10D;esko slovensk&#xE9; Minecraft sc&#xE9;ny.</p>
<p>Vizu&#xE1;ln&#xED; zm&#x11B;ny nejsou to jedin&#xE9;, nejd&#x16F;le&#x17E;it&#x11B;j&#x161;&#xED; zm&#x11B;nou je a d&#xE1;le tak&#xE9; bude samotn&#xE1; funkce j&#xE1;dra webu. Pracuji na zlep&#x161;en&#xED; syst&#xE9;mu tak aby byl efektivn&#x11B;j&#x161;&#xED; a tak&#xE9; mnohem rychlej&#x161;&#xED; ne&#x17E; je aktu&#xE1;ln&#x11B;. Ne&#x17E; ale t&#xE9;to d&#x16F;le&#x17E;it&#xE9; zm&#x11B;ny jak z&#xED;sk&#xE1;v&#xE1;me a p&#x159;edev&#x161;&#xED;m zpracov&#xE1;v&#xE1;me data o jednotliv&#xFD;ch serverech bude doc&#xED;leno bude to je&#x161;t&#x11B; n&#x11B;jakou chv&#xED;li trvat.</p>
<p>A v neposledn&#xED; &#x159;&#xE1;d&#x11B; byl od z&#xE1;kladu zm&#x11B;n&#x11B;n i blog. Kde by se snad m&#x11B;lo &#x10D;asem objevovat i v&#xED;ce &#x10D;l&#xE1;nk&#x16F;.</p>
<h2 id="zveme-t%C4%9B-na-n%C3%A1%C5%A1-discord-server">Zveme t&#x11B; na n&#xE1;&#x161; Discord server!</h2>
<p>Jednou z d&#x16F;le&#x17E;it&#xFD;ch novinek je tak&#xE9; n&#xE1;&#x161; ofici&#xE1;ln&#xED; Discord server. Cht&#x11B;l bych zde vybudovat komunitu pro hr&#xE1;&#x10D;e, majitele a spr&#xE1;vce Minecraft server&#x16F;.</p>
<p>Na serveru se nach&#xE1;z&#xED; vlastn&#xED; bot, kter&#xFD; umo&#x17E;&#x148;uje zalo&#x17E;en&#xED; do&#x10D;asn&#xE9; m&#xED;stnosti a tak&#xE9; propojen&#xED; va&#x161;eho Discord profilu s &#xFA;&#x10D;tem na <a href="http://mcservery.eu/?ref=localhost">mcservery.eu</a></p>
<p>Na z&#xE1;klad&#x11B; propojen&#xED; &#xFA;&#x10D;tu z webu s va&#x161;&#xED;m Discord &#xFA;&#x10D;tem z&#xED;sk&#xE1;te role na serveru.</p>
<p>Pokud jsi <a href="http://discord.com/?ref=localhost">Discord</a> dosud nepou&#x17E;&#xED;val - je zdarma, bezpe&#x10D;n&#xFD; a funguje na po&#x10D;&#xED;ta&#x10D;i i telefonu.</p>
<p><strong>Pozv&#xE1;nka:</strong> <a href="http://discord.mcservery.eu/?ref=localhost">discord.mcservery.eu</a></p>
<p><img src="https://mcservery.eu/assets/img/discord.webp" alt="2.0 Nov&#xFD; design i funkce" loading="lazy"></p>
<h2 id="nev%C3%AD%C5%A1-si-rady-je-tu-centrum-n%C3%A1pov%C4%9Bdy">Nev&#xED;&#x161; si rady? Je tu centrum n&#xE1;pov&#x11B;dy.</h2>
<p>Ka&#x17E;d&#xFD; komplexn&#xED; projekt by m&#x11B;l m&#xED;t svoj&#xED; n&#xE1;pov&#x11B;du, tak aby u&#x17E;ivatel&#xE9; nem&#x11B;li probl&#xE9;m vyu&#x17E;&#xED;vat funkcionalit kter&#xE9; jsou k dispozici. P&#x159;edchoz&#xED; n&#xE1;pov&#x11B;da byla provizorn&#x11B; um&#xED;st&#x11B;na na na&#x161;em <a href="https://github.com/McServery?ref=localhost">GitHubu</a>, nicm&#xE9;n&#x11B; se nejednalo o p&#x159;&#xED;li&#x161; p&#x159;ehledn&#xE9; &#x159;e&#x161;en&#xED;.</p>
<p>S t&#xED;m jak&#xFD; m&#xE1;m do budoucna z&#xE1;m&#x11B;r s projektem <a href="http://mcservery.eu/?ref=localhost">mcservery.eu</a> bylo nutn&#xE9; vytvo&#x159;it p&#x159;ehlednou znalostn&#xED; b&#xE1;zi. Tak aby i budouc&#xED; funkce byly dob&#x159;e zmapov&#xE1;ny a u&#x17E;ivatel&#xE9; nem&#x11B;li probl&#xE9;m s jejich pou&#x17E;&#xED;v&#xE1;n&#xED;m.</p>
<p><img src="https://mcservery.eu/blog/images/2022/07/helpcenter.png" alt="2.0 Nov&#xFD; design i funkce" loading="lazy"></p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[Jak si vede nejoblíbenější sandboxová hra v roce 2021?]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>I kdy&#x17E; je to ji&#x17E; 12 let od po&#x10D;&#xE1;te&#x10D;n&#xED;ho vyd&#xE1;n&#xED; Minecraftu, Mojang udr&#x17E;uje hru na stav&#x11B;n&#xED; blok&#x16F; ve skv&#x11B;l&#xE9; kondici, p&#x159;i&#x10D;em&#x17E; rok 2020 je</p>]]></description><link>http://localhost:2368/jak-si-vede-nejoblibenejsi-sandboxova-hra-v-roce-2021/</link><guid isPermaLink="false">642b2614fefb6657bc0d3399</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Wed, 10 Feb 2021 23:00:00 GMT</pubDate><content:encoded><![CDATA[<!--kg-card-begin: markdown--><p>I kdy&#x17E; je to ji&#x17E; 12 let od po&#x10D;&#xE1;te&#x10D;n&#xED;ho vyd&#xE1;n&#xED; Minecraftu, Mojang udr&#x17E;uje hru na stav&#x11B;n&#xED; blok&#x16F; ve skv&#x11B;l&#xE9; kondici, p&#x159;i&#x10D;em&#x17E; rok 2020 je obzvl&#xE1;&#x161;t&#x11B; skv&#x11B;l&#xFD;m rokem. V lo&#x148;sk&#xE9;m roce jsme vid&#x11B;li nejv&#x11B;t&#x161;&#xED; aktualizaci Minecraftu od chv&#xED;le, kdy byla poprv&#xE9; spu&#x161;t&#x11B;na ve form&#x11B; The Nether, a o necel&#xFD;ch p&#xE1;r m&#x11B;s&#xED;c&#x16F; pozd&#x11B;ji Mojang ozn&#xE1;mil dal&#x161;&#xED; v&#xFD;znamnou aktualizaci pro l&#xE9;to 2021. Tak&#xE9; jsme vid&#x11B;li Mojang vyzkou&#x161;et n&#x11B;co nov&#xE9;ho v podob&#x11B; Minecraft Dungeons, zcela nov&#xE1; hra, kter&#xE1; spojila vizu&#xE1;ly Minecraftu s &#xFA;pln&#x11B; nov&#xFD;m &#x17E;&#xE1;nrem a z&#xED;skala pozitivn&#xED; recenze.</p>
<p>S t&#xED;m, jak Minecraftu ka&#x17E;d&#xFD; rok roste po&#x10D;et hr&#xE1;&#x10D;&#x16F; a Mojang se sna&#x17E;&#xED; zvy&#x161;ovat dosah Minecraftu nov&#xFD;mi hrami a projekty, nav&#xED;c pandemie pomohla p&#x159;il&#xE1;kat v&#xED;ce hr&#xE1;&#x10D;&#x16F;.</p>
<p>P&#x159;i pohledu na &#x10D;&#xED;sla lze s jistotou &#x159;&#xED;ci, &#x17E;e Minecraft si vede docela dob&#x159;e. V kv&#x11B;tnu lo&#x148;sk&#xE9;ho roku Mojang ozn&#xE1;mil, &#x17E;e se Minecraftu prodalo p&#x159;es 200 milion&#x16F; kopi&#xED;, a pot&#xE9; vydal druh&#xE9; ozn&#xE1;men&#xED;, &#x17E;e p&#x159;ekonal 131 milion&#x16F; aktivn&#xED;ch u&#x17E;ivatel&#x16F; m&#x11B;s&#xED;&#x10D;n&#x11B;. Nen&#xED; to v &#x17E;&#xE1;dn&#xE9;m p&#x159;&#xED;pad&#x11B; p&#x159;ekvapen&#xED;, ale je to ur&#x10D;it&#x11B; p&#x16F;sobiv&#xE9;.</p>
<p>Tyto &#xFA;sp&#x11B;chy byly ozn&#xE1;meny p&#x159;&#xED;mo v polovin&#x11B; roku 2020, co&#x17E; se uk&#xE1;zalo jako docela skv&#x11B;l&#xFD; rok pro hr&#xE1;&#x10D;e Minecraftu. Odstartoval rok 2020 nejv&#x11B;t&#x161;&#xED; aktualizac&#xED; hry doposud: The Nether. Tato aktualizace poskytla Minecraftu vylep&#x161;en&#xED; netheru a p&#x159;idala &#x10D;ty&#x159;i nov&#xE9; biomy, spoustu nov&#xFD;ch stra&#x161;ideln&#xFD;ch dav&#x16F; a v&#xED;ce blok&#x16F; zdroj&#x16F;, v&#x10D;etn&#x11B; nov&#xE9; rudy je&#x161;t&#x11B; siln&#x11B;j&#x161;&#xED; ne&#x17E; diamant. Aktualizace byla p&#x159;ijata dob&#x159;e, proto&#x17E;e hr&#xE1;&#x10D;i se postavili v&#xFD;zv&#x11B; p&#x159;e&#x17E;&#xED;t Nether a kreativn&#xED; stavitel&#xE9; se pustili do stavby stra&#x161;ideln&#xFD;ch s&#xED;del a stra&#x161;ideln&#xFD;ch hrad&#x16F; se stra&#x161;ideln&#xFD;mi nov&#xFD;mi bloky.</p>
<p>Pozd&#x11B;ji v tomto roce z&#xED;skal Minecraft nov&#xFD; lesk s patchem Minecraft RTX od spole&#x10D;nosti Nvidia. Minecraft m&#x11B;l v&#x17E;dy spravedliv&#xFD; pod&#xED;l shader&#x16F; a texturov&#xFD;ch bal&#xED;&#x10D;k&#x16F;, aby m&#x11B;l sv&#x11B;t jist&#xFD; lesk, ale Minecraft RTX posunul vizu&#xE1;ln&#xED; prvky hry na zcela jinou &#xFA;rove&#x148;. Kdo mohl p&#x159;edv&#xED;dat, &#x17E;e skromn&#xE9; bloky Minecraftu za&#x17E;ij&#xED; dal&#x161;&#xED; generaci grafick&#xFD;ch oprav?</p>
<p>D&#xED;ky pravideln&#xFD;m oprav&#xE1;m a Mojangu, kter&#xFD; se o hru dob&#x159;e star&#xE1; s hlavn&#xED;mi aktualizacemi, je Minecraft v pokra&#x10D;ov&#xE1;n&#xED; do roku 2021 v docela dobr&#xE9; kondici.</p>
<h1 id="co-se-ned%C3%A1vno-ud%C3%A1lo">Co se ned&#xE1;vno ud&#xE1;lo?</h1>
<ul>
<li>Ozn&#xE1;men&#xED; aktualizace Caves and Cliffs.</li>
<li>Podpora ray-tracingu</li>
<li>Minecraft earth kon&#x10D;&#xED; - Mojang vysv&#x11B;tlil, &#x17E;e hra byla &#x201E;navr&#x17E;ena na z&#xE1;klad&#x11B; voln&#xE9;ho pohybu a spolupr&#xE1;ce - dv&#x11B; v&#x11B;ci, kter&#xE9; se v sou&#x10D;asn&#xE9; glob&#xE1;ln&#xED; situaci staly t&#xE9;m&#x11B;&#x159; nemo&#x17E;n&#xFD;mi&#x201C;.</li>
<li>Minecraft ve &#x161;kol&#xE1;ch - Minecraft: Education Edition z&#xED;sk&#xE1;v&#xE1; na popularit&#x11B; ve t&#x159;&#xED;d&#xE1;ch jako zp&#x16F;sob, jak d&#xE1;t student&#x16F;m nov&#xFD; virtu&#xE1;ln&#xED; prostor, ve kter&#xE9;m se mohou u&#x10D;it. Je to n&#xE1;stroj, kter&#xFD; u&#x10D;itel&#x16F;m pom&#xE1;h&#xE1; u&#x10D;it studenty v &#x159;ad&#x11B; r&#x16F;zn&#xFD;ch p&#x159;edm&#x11B;t&#x16F;, v&#x10D;etn&#x11B; historie, matematiky a p&#x159;&#xED;rodn&#xED;ch v&#x11B;d.</li>
</ul>
<h1 id="kdy-p%C5%99ijde-dal%C5%A1%C3%AD-velk%C3%BD-update">Kdy p&#x159;ijde dal&#x161;&#xED; velk&#xFD; update?</h1>
<p>Dal&#x161;&#xED; velkou aktualizac&#xED; je aktualizace Caves and Cliffs, a a&#x10D;koli Mojang nestanovil konkr&#xE9;tn&#xED; datum, o&#x10D;ek&#xE1;v&#xE1; se, &#x17E;e aktualizace bude spu&#x161;t&#x11B;na v l&#xE9;t&#x11B; 2021. Ponur&#xE9; jeskyn&#x11B; a zasn&#x11B;&#x17E;en&#xE9; vrcholy Minecraftu z&#xED;skaj&#xED; spoustu nov&#xFD;ch blok&#x16F;, mob&#x16F; a p&#x159;edm&#x11B;t&#x16F; s t&#xED;m, jak ob&#x11B; oblasti z&#xED;sk&#xE1;vaj&#xED; slo&#x17E;it&#x11B;j&#x161;&#xED; generaci ter&#xE9;nu - p&#x159;i dal&#x161;&#xED;m kop&#xE1;n&#xED; pod hl&#xED;nou o&#x10D;ek&#xE1;vejte spoustu tunel&#x16F;, jeskyn&#xED;, jeskynn&#xED;ch jezer a podzemn&#xED;ch vodop&#xE1;d&#x16F;.</p>
<p>Nov&#xE1; aktualizace bude tak&#xE9; obsahovat mnohem v&#xED;ce craftingu. Kop&#xE1;n&#xED; v jeskyn&#xED;ch v&#xE1;s nyn&#xED; odm&#x11B;n&#xED; krystaly, v&#x10D;etn&#x11B; t&#x159;pytiv&#xE9;ho ametystu, a budete moci vyrobit spoustu nov&#xE9;ho vybaven&#xED;. Mnoho &#x159;emesel je v sou&#x10D;asn&#xE9; dob&#x11B; pod pokli&#x10D;kou, ale jedna v&#x11B;c, kter&#xE1; bude m&#xED;t ve va&#x161;em invent&#xE1;&#x159;i v&#xED;tan&#xE9; m&#xED;sto, je dalekohled, kter&#xFD; je docela cool.</p>
<p>Aktualizace Minecraftu na v&#xE1;s vrhne spoustu nov&#xFD;ch objekt&#x16F;, aktualizace Caves and Cliffs tak&#xE9; p&#x159;edstav&#xED; nov&#xFD; archeologick&#xFD; syst&#xE9;m, kde hr&#xE1;&#x10D;i mohou p&#x159;i zakop&#xE1;v&#xE1;n&#xED; naj&#xED;t poh&#x159;ben&#xE9; ruiny a speci&#xE1;ln&#xED; p&#x159;edm&#x11B;ty. Existuje dokonce nov&#xFD; zp&#x16F;sob t&#x11B;&#x17E;by, p&#x159;i kter&#xE9;m pomoc&#xED; &#x161;t&#x11B;tce opatrn&#x11B; vykop&#xE1;v&#xE1;te artefakty a sna&#x17E;&#xED;te se je nepo&#x161;kodit.</p>
<p>Aktualizace Caves and Cliffs se jev&#xED; jako objemn&#xE1; a p&#x159;&#xED;jmut&#xED; aktualizace byl celkov&#x11B; pozitivn&#xED;.</p>
<p><img src="https://cdn.mos.cms.futurecdn.net/MLYRehZJ6HWx6g96Yseh5Y-970-80.png.webp" alt="https://cdn.mos.cms.futurecdn.net/MLYRehZJ6HWx6g96Yseh5Y-970-80.png.webp" loading="lazy"></p>
<h1 id="jsou-hr%C3%A1%C4%8Di-spokojen%C3%AD">Jsou hr&#xE1;&#x10D;i spokojen&#xED;?</h1>
<p>Mnoho ozn&#xE1;men&#xED; a aktualizac&#xED; Mojangu byla p&#x159;ijata komunitou s ur&#x10D;it&#xFD;m optimismem. Reputace Mojangu pro vyd&#xE1;v&#xE1;n&#xED; &#x161;pi&#x10D;kov&#xFD;ch aktualizac&#xED; byla d&#xED;ky aktualizaci The Nether upevn&#x11B;na a mnoho hr&#xE1;&#x10D;&#x16F; se t&#x11B;&#x161;&#xED; na Caves and Cliffs update, kter&#xFD; m&#xE1; vyj&#xED;t letos.</p>
<p>&#xDA;sp&#x11B;ch Minecraftu v roce 2020 nen&#xED; jen d&#xED;ky &#xFA;sil&#xED; samotn&#xE9;ho Mojanga, komunita je hnac&#xED; silou kreativity a n&#x11B;kter&#xE9; z nejlep&#x161;&#xED;ch v&#xFD;tvor&#x16F; Minecraftu roku 2020 vytvo&#x159;ili hr&#xE1;&#x10D;i. Vid&#x11B;li jsme vyd&#xE1;n&#xED; nesm&#xED;rn&#x11B; popul&#xE1;rn&#xED; hry Cops and Robbers 5, s&#xE9;rie, kter&#xE1; dokonale zd&#x16F;raz&#x148;uje schopnost Minecraftu vytv&#xE1;&#x159;et hry uvnit&#x159; her. Dal&#x161;&#xED; projekty jako Slumy a panstv&#xED; Juana Sebastiana Murcii vyu&#x17E;ily Minecraftu ke zd&#x16F;razn&#x11B;n&#xED; soci&#xE1;ln&#xED;ch a ekonomick&#xFD;ch rozd&#xED;l&#x16F; po cel&#xE9;m sv&#x11B;t&#x11B;. Jedn&#xED;m z nejp&#x16F;sobiv&#x11B;j&#x161;&#xED;ch pou&#x17E;it&#xED; sandboxu byla The Uncensored Library, ohromuj&#xED;c&#xED; v&#xFD;tvor a d&#x16F;le&#x17E;it&#xE1; iniciativa zah&#xE1;jen&#xE1; Report&#xE9;ry bez hranic, kter&#xE1; d&#xE1;v&#xE1; novin&#xE1;&#x159;&#x16F;m virtu&#xE1;ln&#xED; prostor pro psan&#xED; &#x10D;l&#xE1;nk&#x16F;, kter&#xE9; by byly cenzurov&#xE1;ny v jejich vlastn&#xED; zemi.</p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[Minecraft Earth končí. Hra neustála pandemii]]></title><description><![CDATA[<p>P&#x159;ed v&#xED;ce ne&#x17E; rokem Microsoft p&#x159;edstavil hru Minecraft Earth, ambici&#xF3;zn&#xED; projekt, kter&#xFD; m&#x11B;l b&#xFD;t konkurenc&#xED; pro Pok&#xE9;mon Go. To se mu ale nepovedlo a nav&#xED;c se musel pot&#xFD;kat</p>]]></description><link>http://localhost:2368/minecraft-earth-konci-hra-neustala-pandemii/</link><guid isPermaLink="false">642b2548fefb6657bc0d3385</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Sat, 09 Jan 2021 23:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1587573089734-09cb69c0f2b4?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fG1pbmVjcmFmdCUyMGVhcnRofGVufDB8fHx8MTY4MDU0OTIyOQ&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1587573089734-09cb69c0f2b4?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fG1pbmVjcmFmdCUyMGVhcnRofGVufDB8fHx8MTY4MDU0OTIyOQ&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Minecraft Earth kon&#x10D;&#xED;. Hra neust&#xE1;la pandemii"><p>P&#x159;ed v&#xED;ce ne&#x17E; rokem Microsoft p&#x159;edstavil hru Minecraft Earth, ambici&#xF3;zn&#xED; projekt, kter&#xFD; m&#x11B;l b&#xFD;t konkurenc&#xED; pro Pok&#xE9;mon Go. To se mu ale nepovedlo a nav&#xED;c se musel pot&#xFD;kat s pandemii koronaviru. Ta br&#xE1;n&#xED; hr&#xE1;&#x10D;&#x16F;m v pobytu venku a t&#xED;m p&#xE1;dem i samotn&#xE9; hran&#xED;. V&#xFD;voj&#xE1;&#x159;i sice vydali n&#x11B;kolik updat&#x16F;, aby hra byla hrateln&#xE1; i v dom&#xE1;c&#xED;ch podm&#xED;nk&#xE1;ch, to ale nesta&#x10D;ilo a tak se hra po ne&#xFA;sp&#x11B;chu lou&#x10D;&#xED;.</p><p>Jeliko&#x17E; byla hra Minecraft Earth zalo&#x17E;ena na roz&#x161;&#xED;&#x159;en&#xE9; realit&#x11B; a voln&#xE9;ho pohybu venku, nem&#x11B;la v sou&#x10D;asn&#xE9; dob&#x11B; &#x161;anci usp&#x11B;t. Microsoft se tak rozhodl vydat fin&#xE1;ln&#xED; aktualizaci a hru k 30. &#x10D;ervnu tohoto roku ukon&#x10D;it. Hru ji&#x17E; tak nebude mo&#x17E;n&#xE9; hr&#xE1;t a ani ji st&#xE1;hnout.</p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/AQEizp-VrVU?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Minecraft Earth: Official Reveal Trailer"></iframe></figure>]]></content:encoded></item><item><title><![CDATA[Minecraft s ray tracingem oficiálně vychází pro Windows 10 a je k dispozici všem]]></title><description><![CDATA[<p>Minecraft je ve sv&#x11B;t&#x11B; videoher nepochybn&#x11B; klasikou a s ka&#x17E;dou aktualizac&#xED; st&#xE1;le sb&#xED;r&#xE1; v&#xED;ce a v&#xED;ce hr&#xE1;&#x10D;&#x16F;. Vizu&#xE1;l hry se v&#x161;ak dramaticky nezm&#x11B;nil od vyd&</p>]]></description><link>http://localhost:2368/minecraft-s-ray-tracingem-oficialne-vychazi-pro-windows-10-a-je-k-dispozici-vsem/</link><guid isPermaLink="false">642b1fccfefb6657bc0d3355</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Mon, 07 Dec 2020 23:00:00 GMT</pubDate><content:encoded><![CDATA[<p>Minecraft je ve sv&#x11B;t&#x11B; videoher nepochybn&#x11B; klasikou a s ka&#x17E;dou aktualizac&#xED; st&#xE1;le sb&#xED;r&#xE1; v&#xED;ce a v&#xED;ce hr&#xE1;&#x10D;&#x16F;. Vizu&#xE1;l hry se v&#x161;ak dramaticky nezm&#x11B;nil od vyd&#xE1;n&#xED; Minecraftu v roce 2009, s v&#xFD;razn&#xFD;m vizu&#xE1;ln&#xED;m stylem, kter&#xFD; dob&#x159;e zapad&#xE1; do jak&#xE9;hokoli za&#x159;&#xED;zen&#xED; a jak&#xE9;hokoli hardwaru. Nyn&#xED;, p&#x159;inejmen&#x161;&#xED;m v syst&#xE9;mu Windows 10, je Minecraft s ray tracingem ofici&#xE1;ln&#x11B; vyd&#xE1;n pro ka&#x17E;d&#xE9;ho. Ray tracing p&#x159;in&#xE1;&#x161;&#xED; do Minecraftu zna&#x10D;n&#xE9; vizu&#xE1;ln&#xED; upgrady s vynikaj&#xED;c&#xED;m osv&#x11B;tlen&#xED;m, st&#xED;ny, odrazy, textury, shadery a je&#x161;t&#x11B; mnohem v&#xED;ce. Na prvn&#xED; pohled to opravdu vypad&#xE1; jako &#xFA;pln&#x11B; jin&#xE1; hra. Pro rychl&#xFD; pohled si m&#x16F;&#x17E;ete prohl&#xE9;dnout trailer n&#xED;&#x17E;e.</p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/VM-6da3PB1o?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Minecraft with Ray Tracing for Windows 10: Release Trailer"></iframe></figure><p>Minecraft s RTX byl v beta testov&#xE1;n&#xED; od dubna leto&#x161;n&#xED;ho roku a nakonec si p&#x159;ed n&#x11B;kolika m&#x11B;s&#xED;ci vzal Nether Update a p&#x159;inesl mu aktu&#xE1;ln&#xED; verzi Minecraft bez RTX. Nyn&#xED; je ofici&#xE1;ln&#x11B; k dispozici v&#x161;em, kte&#x159;&#xED; maj&#xED; pot&#x159;ebn&#xFD; hardware, tak&#x17E;e pokud je va&#x161;e hern&#xED; sestava s grafickou kartu RTX od NVIDIA, m&#x16F;&#x17E;ete tak&#xE9; za&#x17E;&#xED;t Minecraft s RTX ray tracing. Je&#x161;t&#x11B; lep&#x161;&#xED; je, &#x17E;e je st&#xE1;le kompatibiln&#xED; s klasick&#xFD;mi vizu&#xE1;ly Minecraftu, tak&#x17E;e m&#x16F;&#x17E;ete zap&#xED;nat a vyp&#xED;nat ray tracing nebo hr&#xE1;t s lidmi, kte&#x159;&#xED; nemaj&#xED; kartu kompatibiln&#xED; s RTX.</p><p>Spolu s vyd&#xE1;n&#xED;m Minecraftu s RTX vyd&#xE1;v&#xE1; Mojang Studios tak&#xE9; zdarma dv&#x11B; nov&#xE9; mapy na Minecraft Marketplace, kter&#xE9; ukazuj&#xED;, co ray tracing p&#x159;in&#xE1;&#x161;&#xED; do jejich kreativn&#xED;ho sandboxu v otev&#x159;en&#xE9;m sv&#x11B;t&#x11B;. Zainteresovan&#xED; hr&#xE1;&#x10D;i si tak&#xE9; mohou vytvo&#x159;it sv&#xE9; vlastn&#xED; bal&#xED;&#x10D;ky textur, kter&#xE9; za&#x10D;nou od nuly pomoc&#xED; ray tracingu.</p><p>Bohu&#x17E;el v Minecraftu pro Xbox Series X | S nen&#xED; slovo, tak&#x17E;e sledov&#xE1;n&#xED; paprsk&#x16F; v tuto chv&#xED;li nep&#x159;ich&#xE1;z&#xED; do Minecraftu na Xbox Series X nebo Xbox Series S. Pokud m&#xE1;te hern&#xED; po&#x10D;&#xED;ta&#x10D; nebo na jeho stavb&#x11B; pracujete a chcete si na vlastn&#xED; k&#x16F;&#x17E;i vyzkou&#x161;et ray tracing, zva&#x17E;te n&#x11B;kter&#xE9; z nejlep&#x161;&#xED;ch grafick&#xFD;ch karet pro hran&#xED;, abyste z&#xED;skali p&#x159;edstavu o tom, co byste m&#x11B;li hledat.</p><figure class="kg-card kg-image-card kg-width-wide"><img src="https://www.nvidia.com/content/dam/en-zz/Solutions/geforce/campaigns/minecraft-with-rtx/hero-v2/minecraft-kv-v2-bottom-parallax-3-desktop.jpg" class="kg-image" alt loading="lazy"></figure>]]></content:encoded></item><item><title><![CDATA[Minecraft 10 věcí co jste nevěděli o vesnicích a vesničanech]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>Vesnice a jejich obyvatel&#xE9; jsou velkou sou&#x10D;&#xE1;st&#xED; z&#xE1;&#x17E;itku z Minecraftu. Jak&#xE1; jsou fascinuj&#xED;c&#xED; fakta o vesni&#x10D;anech a jejich domovech?</p>
<p>P&#x159;i pr&#x16F;zkumu v Minecraftu hr&#xE1;&#x10D; n&#x11B;kdy naraz&#xED; na</p>]]></description><link>http://localhost:2368/minecraft-10-veci-co-jste-nevedeli-o-vesnicich-a-vesnicanech/</link><guid isPermaLink="false">642b1e95fefb6657bc0d3345</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Tue, 01 Dec 2020 23:00:00 GMT</pubDate><content:encoded><![CDATA[<!--kg-card-begin: markdown--><p>Vesnice a jejich obyvatel&#xE9; jsou velkou sou&#x10D;&#xE1;st&#xED; z&#xE1;&#x17E;itku z Minecraftu. Jak&#xE1; jsou fascinuj&#xED;c&#xED; fakta o vesni&#x10D;anech a jejich domovech?</p>
<p>P&#x159;i pr&#x16F;zkumu v Minecraftu hr&#xE1;&#x10D; n&#x11B;kdy naraz&#xED; na vesnice a jejich obyvatele. Existuj&#xED; variace t&#x11B;chto m&#x11B;st v n&#x11B;kolika r&#x16F;zn&#xFD;ch biomech, ale v&#x161;echna obsahuj&#xED; stejn&#xE9; z&#xE1;kladn&#xED; prvky: vesni&#x10D;any, domy a ko&#x159;ist. Na prvn&#xED; pohled m&#x16F;&#x17E;e b&#xFD;t trochu matouc&#xED; zjistit, jak co nejl&#xE9;pe vyu&#x17E;&#xED;t setk&#xE1;n&#xED; s vesnic&#xED;.</p>
<h1 id="10vesnice-m%C4%9Bly-r%C5%AFst"><strong>10 - Vesnice m&#x11B;ly r&#x16F;st</strong></h1>
<p>Podle Jensa Bergenstena, vedouc&#xED;ho kreativn&#xED;ho design&#xE9;ra spole&#x10D;nosti Mojang, m&#x11B;lo doj&#xED;t k n&#xE1;r&#x16F;stu po&#x10D;tu vesni&#x10D;an&#x16F;, pokud hr&#xE1;&#x10D; vylep&#x161;il a doplnil vesnici.</p>
<p>V&#xFD;voj&#xE1;&#x159;i bohu&#x17E;el zjistili, &#x17E;e by to zabralo p&#x159;&#xED;li&#x161; mnoho &#xFA;sil&#xFD; p&#x159;i v&#xFD;voji. Existuj&#xED; v&#x161;ak pravd&#x11B;podobn&#xE9; mody, kter&#xE9; to d&#x11B;laj&#xED;, proto&#x17E;e v desetilet&#xED; od vyd&#xE1;n&#xED; hry existuj&#xED; mody pro t&#xE9;m&#x11B;&#x159; v&#x161;e, co by &#x10D;lov&#x11B;k mohl cht&#xED;t.</p>
<h1 id="9inspirace-pro-vesni%C4%8Dany"><strong>9 - Inspirace pro vesni&#x10D;any</strong></h1>
<p><img src="https://static1.gamerantimages.com/wordpress/wp-content/uploads/2020/11/dungeon-master-2.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" alt="https://static1.gamerantimages.com/wordpress/wp-content/uploads/2020/11/dungeon-master-2.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" loading="lazy"></p>
<p>Vesni&#x10D;an&#xE9; se ve skute&#x10D;nosti inspirovali obchodn&#xED;ky ze hry s n&#xE1;zvem Dungeon Master 2, kter&#xE1; byla vyd&#xE1;na po&#x10D;&#xE1;tkem 90. let.</p>
<p>Byl to dungeonov&#xFD; crawler, se kter&#xFD;m Minecraft krom&#x11B; estetiky vesni&#x10D;ana sd&#xED;l&#xED; i spoustu podobnost&#xED;. Minecraft je legend&#xE1;rn&#xED;, proto&#x17E;e d&#x11B;l&#xE1; n&#x11B;kolik v&#x11B;c&#xED; extr&#xE9;mn&#x11B; dob&#x159;e, ale ani by neexistoval, pokud by to nebylo pro hry Dungeon Master a podobn&#xE9; hry.</p>
<h1 id="8velk%C3%A9-sloupy-se-objevuj%C3%AD-pod-domy"><strong>8 - Velk&#xE9; sloupy se objevuj&#xED; pod domy</strong></h1>
<p>End nen&#xED; jedin&#xFD;m m&#xED;stem s obrovsk&#xFD;mi sloupy. Aby se p&#x159;ede&#x161;lo probl&#xE9;m&#x16F;m s &#x201E;p&#x159;evisem&#x201C;, co&#x17E; je situace, kdy se ve vzduchu objev&#xED; budova nebo &#x10D;&#xE1;st vesnice s velkou mezerou, vytvo&#x159;&#xED; d&#x16F;m pod svou podlahou a pro ka&#x17E;d&#xFD; pr&#xE1;zdn&#xFD; prostor pod n&#xED; bloky hl&#xED;ny, dokud na n&#x11B;co nenaraz&#xED;.</p>
<p>Pokud k tomu dojde na velk&#xE9;m otev&#x159;en&#xE9;m prostranstv&#xED;, jako je rokle, vytvo&#x159;il by se mohutn&#xFD; sloupec hl&#xED;ny, aby d&#x16F;m podep&#x159;el.</p>
<h1 id="7pigmeni-m%C4%9Bli-b%C3%BDt-vesni%C4%8Dani"><strong>7 - Pigmeni m&#x11B;li b&#xFD;t vesni&#x10D;ani</strong></h1>
<p>Podle samotn&#xE9;ho Notche na Twitteru m&#x11B;li b&#xFD;t Pigmen, podobn&#x11B; jako ti, kte&#x159;&#xED; ob&#xFD;vaj&#xED; The Nether, p&#x16F;vodn&#x11B; vesni&#x10D;an&#xE9;.</p>
<p>Doufejme, &#x17E;e bylo pl&#xE1;nov&#xE1;no, &#x17E;e budou na&#x17E;ivu a neozbrojeni m&#xED;sto potenci&#xE1;ln&#x11B; n&#xE1;siln&#xFD;ch a rozpadaj&#xED;c&#xED;ch se t&#x11B;l, kter&#xE9; maj&#xED; v &#x159;&#xED;&#x161;i Ghast&#x16F; a l&#xE1;vy.</p>
<h1 id="6osam%C4%9Bl%C3%BD-vesni%C4%8Dan"><strong>6 - Osam&#x11B;l&#xFD; vesni&#x10D;an</strong></h1>
<p><img src="https://static1.gamerantimages.com/wordpress/wp-content/uploads/2020/11/one-house.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" alt="https://static1.gamerantimages.com/wordpress/wp-content/uploads/2020/11/one-house.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" loading="lazy"></p>
<p>Vesnice se ne v&#x17E;dy spawnuj&#xED; jako skupina dom&#x16F;. N&#x11B;kdy se objev&#xED; pouze jeden d&#x16F;m s jedn&#xED;m osam&#x11B;l&#xFD;m vesni&#x10D;anem. Kv&#x16F;li prom&#x11B;nn&#xFD;m v k&#xF3;dov&#xE1;n&#xED; hry ob&#x10D;as zvol&#xED; extr&#xE9;my, co&#x17E; bude m&#xED;t za n&#xE1;sledek velmi mal&#xE9; nebo velmi velk&#xE9; mno&#x17E;stv&#xED; dom&#x16F;.</p>
<p>N&#x11B;kte&#x159;&#xED; to pova&#x17E;uj&#xED; za smutn&#xE9;, ale je mo&#x17E;n&#xE9;, &#x17E;e si tento vesni&#x10D;an u&#x17E;&#xED;v&#xE1; klid, kter&#xFD; mu m&#x16F;&#x17E;e p&#x159;in&#xE9;st samota; &#x17E;&#xED;t &#x17E;ivot poustevn&#xED;ka.</p>
<h1 id="5vesni%C4%8Dan%C3%A9-mohou-b%C4%9B%C5%BEet-rychleji-ne%C5%BE-hr%C3%A1%C4%8D"><strong>5 - Vesni&#x10D;an&#xE9; mohou b&#x11B;&#x17E;et rychleji ne&#x17E; hr&#xE1;&#x10D;</strong></h1>
<p>Norm&#xE1;ln&#x11B; se vesni&#x10D;an&#xE9; p&#x159;i pln&#x11B;n&#xED; sv&#xFD;ch r&#x16F;zn&#xFD;ch &#xFA;kol&#x16F; pohybuj&#xED; pomal&#xFD;m a&#x17E; st&#x159;edn&#xED;m tempem. Ale kdy&#x17E; padne noc, sp&#x11B;chaj&#xED; do interi&#xE9;ru rychleji, ne&#x17E; se hr&#xE1;&#x10D; dok&#xE1;&#x17E;e h&#xFD;bat. Tito prost&#xED; lid&#xE9; nedisponuj&#xED; &#x17E;&#xE1;dn&#xFD;mi zbran&#x11B;mi ani brn&#x11B;n&#xED;m, aby se chr&#xE1;nili, tak&#x17E;e pokud obrana jejich vesnice nesta&#x10D;&#xED; na to, aby nedoch&#xE1;zelo k ohro&#x17E;en&#xED;, jejich jedinou mo&#x17E;nost&#xED; p&#x159;e&#x17E;it&#xED; je uniknout z toho, co se k jejich domovu p&#x159;ibl&#xED;&#x17E;&#xED;.</p>
<p>Tento t&#xE9;m&#x11B;&#x159; nep&#x159;irozen&#x11B; rychl&#xFD; pohyb je pravd&#x11B;podobn&#x11B; &#xFA;mysln&#xFD; a prost&#x159;edek umo&#x17E;&#x148;uj&#xED;c&#xED; vesni&#x10D;an&#x16F;m &#x17E;&#xED;t o n&#x11B;co d&#xE9;le v n&#x11B;kdy krut&#xE9;m sv&#x11B;t&#x11B; Minecraftu.</p>
<h1 id="4farm%C3%A1%C5%99i-jsou-lep%C5%A1%C3%AD-ne%C5%BE-v%C4%9Bt%C5%A1ina-hr%C3%A1%C4%8D%C5%AF-v-zem%C4%9Bd%C4%9Blstv%C3%AD"><strong>4 - Farm&#xE1;&#x159;i jsou lep&#x161;&#xED; ne&#x17E; v&#x11B;t&#x161;ina hr&#xE1;&#x10D;&#x16F; v zem&#x11B;d&#x11B;lstv&#xED;</strong></h1>
<p><img src="https://static3.gamerantimages.com/wordpress/wp-content/uploads/2020/11/minecraft-farmer-villager.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" alt="https://static3.gamerantimages.com/wordpress/wp-content/uploads/2020/11/minecraft-farmer-villager.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" loading="lazy"></p>
<p>Farm&#xE1;&#x159;i jsou jedni z nejpracovit&#x11B;j&#x161;&#xED;ch vesni&#x10D;an&#x16F;. Cel&#xFD; den pe&#x10D;uj&#xED; o sv&#xE1; pole a d&#xE1;vaj&#xED; pozor, aby jejich plodiny rostly velk&#xE9; a siln&#xE9;.</p>
<p>Aktivn&#x11B; pou&#x17E;&#xED;vaj&#xED; bonemeal na rostliny, aby urychlily jejich r&#x16F;st, a tak&#xE9; budou d&#xE1;vat n&#xE1;hradn&#xED; semena do kompost&#xE9;r&#x16F;. Jejich AI je dokonce natolik sofistikovan&#xE1;, aby rozpoznala a vyzvedla tyto p&#x159;edm&#x11B;ty.</p>
<h1 id="3vesni%C4%8Dan%C3%A9-mohou-sp%C3%A1t-v-lod%C3%ADch"><strong>3 - Vesni&#x10D;an&#xE9; mohou sp&#xE1;t v lod&#xED;ch</strong></h1>
<p><img src="https://static0.gamerantimages.com/wordpress/wp-content/uploads/2020/11/villager-sleeping-in-boat.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" alt="https://static0.gamerantimages.com/wordpress/wp-content/uploads/2020/11/villager-sleeping-in-boat.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" loading="lazy"></p>
<p>Pokud je vesni&#x10D;anova postel bl&#xED;zko, ale je na lodi, m&#x16F;&#x17E;e si lehnout a odpo&#x10D;&#xED;vat v d&#x159;ev&#x11B;n&#xE9; lodi. Vypad&#xE1; to trochu stra&#x161;ideln&#x11B;, skoro jako by le&#x17E;ely v otev&#x159;en&#xE9; rakvi, ale m&#x16F;&#x17E;e to b&#xFD;t tak&#xE9; komick&#xE9;. N&#x11B;kdy, kdy&#x17E; k tomu dojde, &#x10D;&#xE1;sti t&#x11B;la vesni&#x10D;ana projdou &#x10D;lunem nebo se jejich t&#x11B;lo zkrout&#xED; do zvl&#xE1;&#x161;tn&#xED;ch poloh.</p>
<p>Je mo&#x17E;n&#xE9;, &#x17E;e je to kv&#x16F;li vesni&#x10D;an&#x16F;m, kte&#x159;&#xED; nemaj&#xED; spr&#xE1;vnou animaci pro posezen&#xED; na lodi, jako to d&#x11B;l&#xE1; hr&#xE1;&#x10D;, tak&#x17E;e bu&#x10F; vstanou rovn&#x11B;, nebo si lehnou.</p>
<h1 id="2skiny-vesni%C4%8Dan%C5%AF-jsou-detailn%C4%9Bj%C5%A1%C3%AD"><strong>2 - Skiny vesni&#x10D;an&#x16F; jsou detailn&#x11B;j&#x161;&#xED;</strong></h1>
<p><img src="https://static0.gamerantimages.com/wordpress/wp-content/uploads/2020/11/pjimage-33.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" alt="https://static0.gamerantimages.com/wordpress/wp-content/uploads/2020/11/pjimage-33.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" loading="lazy"></p>
<p>Nyn&#xED; existuj&#xED; &#x159;&#xE1;dn&#xE9; vesnice v d&#x17E;ungli a ba&#x17E;in&#xE1;ch, dopln&#x11B;n&#xE9; podrobn&#xFD;m nov&#xFD;m oble&#x10D;en&#xED;m vesni&#x10D;an&#x16F;. Vesni&#x10D;an&#xE9; z d&#x17E;ungle vypadaj&#xED;, jako by m&#x11B;li nosit jak&#xE9;si zv&#xED;&#x159;ec&#xED; ko&#x17E;e&#x161;inov&#xE9; oble&#x10D;en&#xED;. &#x17D;lut&#xE1; a hn&#x11B;d&#xE1; vypadaj&#xED;, jako by to mohla b&#xFD;t ocelotsk&#xE1; ko&#x17E;e&#x161;ina.</p>
<p>Tak&#xE9; se zd&#xE1;, &#x17E;e maj&#xED; zelen&#xFD; p&#xE1;s vyroben&#xFD; z vinn&#xE9; r&#xE9;vy. Ba&#x17E;in&#xED; vesni&#x10D;an&#xE9; jsou pokryt&#xED; mechem a na hlav&#xE1;ch nos&#xED; podlo&#x17E;ky s liliemi. Oba typy maj&#xED; okouzluj&#xED;c&#xED; vzory, kter&#xE9; mohou z&#x16F;stat bez pov&#x161;imnut&#xED;, pokud hr&#xE1;&#x10D; sp&#x11B;ch&#xE1;.</p>
<h1 id="1ravagers-ni%C4%8D%C3%AD-%C3%BArodu"><strong>1 - Ravagers ni&#x10D;&#xED; &#xFA;rodu</strong></h1>
<p><img src="https://static2.gamerantimages.com/wordpress/wp-content/uploads/2020/11/ravager.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" alt="https://static2.gamerantimages.com/wordpress/wp-content/uploads/2020/11/ravager.jpg?q=50&amp;fit=crop&amp;w=740&amp;h=370" loading="lazy"></p>
<p>Tito drsn&#xED; nep&#x159;&#xE1;tel&#xE9; jsou pro hr&#xE1;&#x10D;e nejen v&#xFD;zvou, ale tak&#xE9; mohou zp&#x16F;sobit probl&#xE9;my vesnic&#xED;m a vesni&#x10D;an&#x16F;m. Maj&#xED; schopnost ni&#x10D;it &#xFA;rodu a v&#xE1;&#x17E;n&#x11B; zranit vesni&#x10D;any do bodu, kdy je to m&#x16F;&#x17E;e p&#x159;&#xED;mo zab&#xED;t.</p>
<p>Nav&#xED;c se tento agresivn&#xED; dav objevuje b&#x11B;hem n&#xE1;jezd&#x16F;, co&#x17E; je nejhor&#x161;&#xED; doba, kdy se mohou objevit. Jsou dokonce dost sm&#x11B;l&#xED;, aby si vzali &#x17E;elezn&#xE9; golemy. Tato zv&#xED;&#x159;ata v kombinaci s drancova&#x10D;i jsou pro v&#x11B;t&#x161;inu vesnic obvykle koncem.</p>
<p><em>Zdroj: <a href="https://gamerant.com/minecraft-villages-villagers-facts/?ref=localhost">https://gamerant.com/minecraft-villages-villagers-facts/</a></em></p>
<!--kg-card-end: markdown-->]]></content:encoded></item><item><title><![CDATA[Minecraft bude pro hraní v roce 2021 vyžadovat účet Microsoft]]></title><description><![CDATA[<p>Hr&#xE1;&#x10D;i Minecraftu mohli hr&#xE1;t bez Microsoft &#xFA;&#x10D;tu posledn&#xED;ch 6 let, kdy Microsoft tuto hru koupil od studia Mojang. To se ale m&#xE1; v roce 2021 zm&#x11B;nit, ozn&#xE1;mil to Microsoft na ofici&#xE1;ln&#xED;m blogu</p>]]></description><link>http://localhost:2368/minecraft-bude-pro-hrani-v-roce-2021-vyzadovat-ucet-microsoft/</link><guid isPermaLink="false">642b1a4ffefb6657bc0d332a</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Thu, 19 Nov 2020 23:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1570063578733-6a33b69d1439?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDF8fG1pY3Jvc29mdHxlbnwwfHx8fDE2ODA0NzAwMDc&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1570063578733-6a33b69d1439?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDF8fG1pY3Jvc29mdHxlbnwwfHx8fDE2ODA0NzAwMDc&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Minecraft bude pro hran&#xED; v roce 2021 vy&#x17E;adovat &#xFA;&#x10D;et Microsoft"><p>Hr&#xE1;&#x10D;i Minecraftu mohli hr&#xE1;t bez Microsoft &#xFA;&#x10D;tu posledn&#xED;ch 6 let, kdy Microsoft tuto hru koupil od studia Mojang. To se ale m&#xE1; v roce 2021 zm&#x11B;nit, ozn&#xE1;mil to Microsoft na ofici&#xE1;ln&#xED;m blogu Minecraftu. Hr&#xE1;&#x10D;i kte&#x159;&#xED; vlastn&#xED; p&#x16F;vodn&#xED; verzi hry a nep&#x159;ejdou na &#xFA;&#x10D;et Microsoft nebudou moci d&#xE1;le hr&#xE1;t. Od sv&#xE9;ho uveden&#xED; na konzole v roce 2011 hra existuje ve dvou samostatn&#x11B; vyv&#xED;jen&#xFD;ch verz&#xED;ch. D&#x159;&#xED;ve p&#x16F;vodn&#xED; Minecraft: Java Edition pou&#x17E;&#xED;vala &#xFA;&#x10D;ty Mojang, zat&#xED;mco Minecraft: Bedrock Edition, n&#xE1;zev hry pro konzoli a Windows Store, pou&#x17E;&#xED;val &#xFA;&#x10D;ty Microsoft. Po t&#xE9;to zm&#x11B;n&#x11B; budou &#xFA;&#x10D;ty stejn&#xE9;, ale st&#xE1;le zde nebude &#x17E;&#xE1;dn&#xFD; cross play: pomoc&#xED; jin&#xE9; verze hry nad&#xE1;le nebudete moci hr&#xE1;t s p&#x159;&#xE1;teli. Seznam v&#xFD;hod kter&#xE9; p&#x159;inese p&#x159;echod na Microsoft &#xFA;&#x10D;ty zahrnuje zv&#xFD;&#x161;en&#xED; zabezpe&#x10D;en&#xED; &#xFA;&#x10D;tu pomoc&#xED; dvoufaktorov&#xE9; autentizace, mo&#x17E;nost blokov&#xE1;n&#xED; chatu a pozv&#xE1;nek s vylep&#x161;enou rodi&#x10D;ovskou kontrolu. </p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/i9cqIwrgz7w?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Java Account Migration: A Fun Announcement by Dinnerbone"></iframe></figure><p>Pokud chcete &#xFA;&#x10D;et konvertovat, p&#x159;ihlaste se na Minecraft.net a tam by se m&#x11B;la &#x10D;asem objevit informace (stejn&#x11B; jako v launcheru), &#x17E;e jde &#xFA;&#x10D;et p&#x159;ev&#xE9;st. Pak je t&#x159;eba zvolit st&#xE1;vaj&#xED;c&#xED; nebo nov&#xFD; &#xFA;&#x10D;et Microsoft. Pro jeden &#xFA;&#x10D;et Mojang pot&#x159;ebujete jeden &#xFA;&#x10D;et Microsoftu. P&#x159;ihla&#x161;ovac&#xED; jm&#xE9;no m&#x16F;&#x17E;e b&#xFD;t zm&#x11B;n&#x11B;no, ale p&#x159;ezd&#xED;vka ve h&#x159;e by m&#x11B;la z&#x16F;stat zachov&#xE1;na. Jinak hra bude nezm&#x11B;n&#x11B;na, stejn&#x11B; jako doposud nep&#x16F;jde hr&#xE1;t mezi Java Edition a Windows 10 Edition. </p><blockquote>- MINECRAFT - Launcher had an update, including the possibility to enter the Microsoft account and a new initial interface, remembering that the account migration has not started yet because it will start in 2021, Mojang is given the task of starting to announce the migration https://t.co/KBHtyuf5yl</blockquote><p><em>Zdroj: <a href="https://www.minecraft.net/da-dk/article/java-edition-moving-house?ref=localhost">https://www.minecraft.net/da-dk/article/java-edition-moving-house</a></em></p>]]></content:encoded></item><item><title><![CDATA[Jak propagovat váš Minecraft server a přilákat více hráčů]]></title><description><![CDATA[<!--kg-card-begin: markdown--><p>Pokud m&#xE1;te skv&#x11B;l&#xFD; server, pak je snadn&#xE9; p&#x159;im&#x11B;t hr&#xE1;&#x10D;e aby z&#x16F;stali. Nejt&#x11B;&#x17E;&#x161;&#xED; &#x10D;&#xE1;sti ale je prvn&#x11B; naj&#xED;t hr&#xE1;&#x10D;e kte&#x159;&#xED; by si</p>]]></description><link>http://localhost:2368/jak-propagovat-vas-minecraft-server-a-prilakat-vice-hracu/</link><guid isPermaLink="false">642b1012fefb6657bc0d330f</guid><category><![CDATA[Články]]></category><dc:creator><![CDATA[mcservery.eu]]></dc:creator><pubDate>Mon, 16 Nov 2020 23:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1656639969815-1194ca7273bd?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDE4fHxtaW5lY3JhZnQlMjBzZXJ2ZXJ8ZW58MHx8fHwxNjgwNTQzODg4&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<!--kg-card-begin: markdown--><img src="https://images.unsplash.com/photo-1656639969815-1194ca7273bd?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDE4fHxtaW5lY3JhZnQlMjBzZXJ2ZXJ8ZW58MHx8fHwxNjgwNTQzODg4&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Jak propagovat v&#xE1;&#x161; Minecraft server a p&#x159;il&#xE1;kat v&#xED;ce hr&#xE1;&#x10D;&#x16F;"><p>Pokud m&#xE1;te skv&#x11B;l&#xFD; server, pak je snadn&#xE9; p&#x159;im&#x11B;t hr&#xE1;&#x10D;e aby z&#x16F;stali. Nejt&#x11B;&#x17E;&#x161;&#xED; &#x10D;&#xE1;sti ale je prvn&#x11B; naj&#xED;t hr&#xE1;&#x10D;e kte&#x159;&#xED; by si na va&#x161;em Minecraft serveru zahr&#xE1;li. Bez komunity by byly Minecraft servery nudn&#xE9;!</p>
<p>Tento &#x10D;l&#xE1;nek v&#xE1;m pom&#x16F;&#x17E;e zv&#xFD;&#x161;it po&#x10D;et hr&#xE1;&#x10D;&#x16F; na va&#x161;em serveru t&#xED;m, &#x17E;e v&#xE1;m uk&#xE1;&#x17E;e, jak propagovat v&#xE1;&#x161; server. &#x10C;&#xED;m popul&#xE1;rn&#x11B;j&#x161;&#xED; se v&#xE1;&#x161; server stane, t&#xED;m v&#xED;ce hr&#xE1;&#x10D;&#x16F; p&#x159;il&#xE1;k&#xE1; aby ho alespo&#x148; zkusily a pak t&#x159;eba i z&#x16F;stali jako st&#xE1;l&#xFD; hr&#xE1;&#x10D;i.</p>
<p>Po proveden&#xED; v&#x161;ech krok&#x16F;, kter&#xE9; zde najdete, v&#xE1;m pom&#x16F;&#x17E;eme bezplatn&#x11B; propagovat v&#xE1;&#x161; Minecraft server. Pokud m&#xE1;te n&#x11B;jak&#xE9; finance na v&#xED;c kter&#xE9; by jste byly ochotn&#xED; pou&#x17E;&#xED;t na propagaci va&#x161;eho serveru, m&#x16F;&#x17E;ete pou&#x17E;&#xED;t dal&#x161;&#xED; metody jako jsou placen&#xE9; reklamy na internetu (Nap&#x159;&#xED;klad: <a href="https://ads.google.com/intl/cs_cz/home/?ref=localhost">Google Ads</a>), sout&#x11B;&#x17E;e o hodnotn&#xE9; ceny pro va&#x161;e hr&#xE1;&#x10D;e a podobn&#x11B;..</p>
<p>P&#x159;ed propagac&#xED; va&#x161;eho serveru se ujist&#x11B;te, &#x17E;e je pln&#x11B; p&#x159;ipraven pro ve&#x159;ejnost. Pokud jste pr&#xE1;v&#x11B; spustili server a st&#xE1;le se v&#x11B;nujete nastavov&#xE1;n&#xED; a budov&#xE1;n&#xED;, nemus&#xED; b&#xFD;t va&#x161;i hr&#xE1;&#x10D;i nad&#x161;en&#xED; z komplikac&#xED; p&#x159;i hran&#xED; jejich hry a p&#x159;echodu na nov&#xFD; server.</p>
<h1 id="p%C5%99idejte-se-na-server-list">P&#x159;idejte se na <a href="https://mcservery.eu/?ref=localhost">server list</a></h1>
<p>Dal&#x161;&#xED; metodou, kter&#xE1; v&#xE1;m pom&#x16F;&#x17E;e z&#xED;skat u&#x17E;ivatele, je propagovat v&#xE1;&#x161; server na m&#xED;stech, kde je jich nadbytek. V&#x11B;&#x159;te tomu nebo ne, lid&#xE9; st&#xE1;le hledaj&#xED; nov&#xFD; server na kter&#xE9;m by si mohli zahr&#xE1;t s p&#x159;&#xE1;teli. Bez ohledu na to, jak nov&#xFD;, star&#xFD;, skv&#x11B;l&#xFD; nebo &#x161;patn&#xFD; je v&#xE1;&#x161; server. Jsou lid&#xE9; kte&#x159;&#xED; si cht&#x11B;j&#xED; zahr&#xE1;t a jedin&#xE9; co mus&#xED;te vy jako majitel serveru ud&#x11B;lat, je dostat odkaz na v&#xE1;&#x161; server p&#x159;ed n&#x11B;. D&#x16F;le&#x17E;it&#xFD; tak&#xE9; je, jak bude v&#xE1;&#x161; server p&#x16F;sobit. Zaujm&#x11B;te hr&#xE1;&#x10D;e zaj&#xED;mav&#xFD;m a origin&#xE1;ln&#xED;m popisem va&#x161;eho serveru, vyzdvihn&#x11B;te pro&#x10D; hr&#xE1;t zrovna na va&#x161;em serveru. Nepi&#x161;t&#x11B; ale to jak je v&#xE1;&#x161; server nejlep&#x161;&#xED; na sv&#x11B;te, to nikoho p&#x159;&#xED;li&#x161; nezaj&#xED;m&#xE1;. Rad&#x11B;ji se rozepi&#x161;te o tom co v&#xE1;&#x161; server nab&#xED;z&#xED; a jak se m&#x16F;&#x17E;e hr&#xE1;&#x10D; zabavit.</p>
<p>Po p&#x159;id&#xE1;n&#xED; se na server list je tak&#xE9; velice d&#x16F;le&#x17E;it&#xE9; aby va&#x161;i ji&#x17E; st&#xE1;vaj&#xED;c&#xED; hr&#xE1;&#x10D;i chodili podpo&#x159;it v&#xE1;&#x161; server hlasov&#xE1;n&#xED;m, z&#xED;sk&#xE1;te tak lep&#x161;&#xED; um&#xED;st&#x11B;n&#xED; na server listu, a je tak v&#x11B;t&#x161;&#xED; &#x161;ance &#x17E;e si nov&#xFD; lid&#xE9; v&#x161;imnou pr&#xE1;v&#x11B; va&#x161;eho Minecraft serveru.</p>
<h1 id="povolte-votifier">Povolte Votifier</h1>
<p>&quot;Votifier is a Bukkit plugin whose purpose is to get notified (aka votified) when a vote is made on a Minecraft server list for the server. Votifier creates a lightweight server that waits for connections by a Minecraft server list and uses a simple protocol to get information about that vote. Votifier is and always will be open-source.&quot; - <em>Tv&#x16F;rce Votifieru</em></p>
<p>To znamen&#xE1;, &#x17E;e server odm&#x11B;&#x148;uje hr&#xE1;&#x10D;e, kte&#x159;&#xED; pro v&#xE1;s chod&#xED; pravideln&#x11B; hlasovat. Votifier se pou&#x17E;&#xED;v&#xE1; za &#xFA;&#x10D;elem udr&#x17E;en&#xED; slu&#x161;n&#xE9;ho m&#xED;sta na server listu. V&#x11B;t&#x161;ina velk&#xFD;ch server&#x16F; tento plugin pou&#x17E;&#xED;v&#xE1;, a Vy by jste m&#x11B;li tak&#xE9;. Po p&#x159;id&#xE1;n&#xED; pluginu nezapome&#x148;te v&#x161;e pe&#x10D;liv&#x11B; vyzkou&#x161;et, pokud by nap&#x159;&#xED;klad hr&#xE1;&#x10D; za hlasov&#xE1;n&#xED; nedostal odm&#x11B;nu mohlo by se st&#xE1;t &#x17E;e u&#x17E; pro v&#xE1;s hlasovat nebude. K otestov&#xE1;n&#xED; spr&#xE1;vn&#xE9;ho nastaven&#xED; lze pou&#x17E;&#xED;t <a href="https://mctools.org/votifier-tester?ref=localhost">tuto str&#xE1;nku</a>.</p>
<p>Propagace a pou&#x17E;&#xED;v&#xE1;n&#xED; hlasovac&#xED;ho n&#xE1;stroje na va&#x161;em serveru m&#x16F;&#x17E;e zv&#xFD;&#x161;it va&#x161;e hlasy o obrovskou &#x10D;&#xE1;st a je nutnost&#xED; pro ka&#x17E;d&#xFD; server. V&#x11B;t&#x161;ina hr&#xE1;&#x10D;&#x16F; Minecraftu proch&#xE1;z&#xED; seznamy server&#x16F;, aby na&#x161;la nov&#xE9; servery. Pokud v&#xE1;&#x161; server nebude vid&#x11B;t, nemohou se hr&#xE1;&#x10D;i ani p&#x159;ipojit. Ur&#x10D;it&#x11B; vyu&#x17E;ijte v&#xFD;hod Votifieru, vy&#x161;&#x161;&#xED; odm&#x11B;ny maj&#xED; za n&#xE1;sledek &#x10D;ast&#x11B;j&#x161;&#xED; hlasov&#xE1;n&#xED;.</p>
<p>Jak Votifier nastavit jsem ji&#x17E; popsal <a href="https://help.mcservery.eu/spravci-serveru/odme-ny-za-hlasovani-votifier?ref=localhost">zde</a>.</p>
<h1 id="%C5%99ekn%C4%9Bte-o-serveru-p%C5%99%C3%A1tel%C5%AFm">&#x158;ekn&#x11B;te o serveru p&#x159;&#xE1;tel&#x16F;m</h1>
<p>Minecraft je jednou z nejpopul&#xE1;rn&#x11B;j&#x161;&#xED;ch po&#x10D;&#xED;ta&#x10D;ov&#xFD;ch her dne&#x161;ka. Tuto hru m&#xE1; velk&#xE1; &#x10D;&#xE1;st lid&#xED; a mohou to b&#xFD;t potenci&#xE1;ln&#xED; hr&#xE1;&#x10D;i na va&#x161;em serveru, sta&#x10D;&#xED; je p&#x159;im&#x11B;t, aby se p&#x159;ipojili. Pokud pou&#x17E;&#xED;v&#xE1;te soci&#xE1;ln&#xED; s&#xED;t&#x11B;, pak by zve&#x159;ejn&#x11B;n&#xED; informac&#xED; o va&#x161;em serveru p&#x159;&#xE1;tel&#x16F;m a follower&#x16F;m bylo va&#x161;&#xED;m nejlep&#x161;&#xED;m &#x159;e&#x161;en&#xED;m pro z&#xED;sk&#xE1;n&#xED; nov&#xFD;ch hr&#xE1;&#x10D;&#x16F;. Nav&#xED;c to komunitu upev&#x148;uje t&#xED;m, &#x17E;e u&#x17E; jste s n&#x11B;k&#xFD;m v kontaktu, ne&#x17E; s n&#xED;m budete hr&#xE1;t Minecraftu.</p>
<p>Jedinou nev&#xFD;hodou t&#xE9;to metody je, &#x17E;e n&#x11B;kdy p&#x159;&#xE1;tel&#xE9; a p&#x159;&#xED;buzn&#xED; mohou cht&#xED;t na va&#x161;em serveru vy&#x161;&#x161;&#xED; &#xFA;rove&#x148; nebo v&#xFD;hody, proto&#x17E;e v&#xE1;s znaj&#xED;. To m&#x16F;&#x17E;e b&#xFD;t nef&#xE9;r v&#x16F;&#x10D;i ostatn&#xED;m hr&#xE1;&#x10D;&#x16F;m a je zcela na spr&#xE1;vci serveru, aby ur&#x10D;il, zda by jejich p&#x159;&#xE1;tel&#xE9; / p&#x159;&#xED;buzn&#xED; m&#x11B;li m&#xED;t opr&#xE1;vn&#x11B;n&#xED;.</p>
<h1 id="placen%C3%A1-propagace">Placen&#xE1; propagace</h1>
<p>Pokud ji&#x17E; m&#xE1;te server rozjet&#xFD; a m&#xE1;te n&#x11B;jak&#xE9; rezervy nav&#xED;c, kter&#xE9; kdy&#x17E; vynalo&#x17E;&#xED;te za propagaci neohroz&#xED; chod serveru, pak je to zp&#x16F;sob kter&#xFD;m se vydat. Existuje mnoho platforem, kter&#xE9; nab&#xED;zej&#xED; placenou reklamu, a m&#x16F;&#x17E;ete se rozhodnout zda j&#xED;t p&#x159;&#xED;mo za n&#x11B;jakou propagac&#xED; na server listu nebo &#x161;ir&#x161;&#xED; s&#xED;t&#xED; jako je Google Ads nebo nap&#x159;&#xED;klad &#x10D;esk&#xE1; obdoba sklik od Seznamu.</p>
<p>Ujist&#x11B;te se, &#x17E;e pokud d&#x11B;l&#xE1;te placen&#xE9; reklamy, provedete sv&#x16F;j pr&#x16F;zkum trhu, abyste neztr&#xE1;celi pen&#xED;ze. Nevyhazujte pen&#xED;ze na projekty, pokud nebudou fungovat. M&#xED;t reklamn&#xED; strategii v&#xE1;m m&#x16F;&#x17E;e nesm&#xED;rn&#x11B; pomoci.</p>
<h1 id="nahrajte-video-na-youtube">Nahrajte video na YouTube</h1>
<p>Pokud m&#xE1;te zku&#x161;enosti v tvorb&#x11B; vide&#xED;, m&#x16F;&#x17E;ete je uplatnit kdy&#x17E; zkus&#xED;te vytvo&#x159;it propaga&#x10D;n&#xED; video pro v&#xE1;&#x161; server. Nemus&#xED;te to ani d&#x11B;lat sami, m&#x16F;&#x17E;ete po&#x17E;&#xE1;dat n&#x11B;koho jin&#xE9;ho, aby to ud&#x11B;lal za v&#xE1;s. Pokud tak bude n&#x11B;kdo hledat videa z Minecraftu je &#x161;ance &#x17E;e se zobraz&#xED; pr&#xE1;v&#x11B; to va&#x161;e.</p>
<p>N&#xE1;pady na videa zahrnuj&#xED; p&#x159;&#xED;mo reklamu nebo m&#x16F;&#x17E;ete p&#x159;im&#x11B;t hr&#xE1;&#x10D;e, aby nat&#xE1;&#x10D;eli videa s doporu&#x10D;en&#xED;mi o tom, jak skv&#x11B;l&#xFD; je v&#xE1;&#x161; server a pro&#x10D; se tak&#xE9; p&#x159;idat. Oba n&#xE1;pady funguj&#xED; velmi dob&#x159;e. Mo&#x17E;nost&#xED; je mnoho, a pokud v&#xE1;s napadne lep&#x161;&#xED; n&#xE1;pad, m&#x11B;li byste do toho j&#xED;t!</p>
<h1 id="po%C5%BE%C3%A1dejte-hr%C3%A1%C4%8De-aby-pozvali-sv%C3%A9-p%C5%99%C3%A1tel%C3%A9">Po&#x17E;&#xE1;dejte hr&#xE1;&#x10D;e aby pozvali sv&#xE9; p&#x159;&#xE1;tel&#xE9;</h1>
<p>Neexistuje lep&#x161;&#xED; pocit ne&#x17E; m&#xED;t popul&#xE1;rn&#xED; hr&#xE1;&#x10D;e na va&#x161;em serveru. Kdy&#x17E; na v&#xE1;&#x161; server p&#x159;ijdou popul&#xE1;rn&#xED; hr&#xE1;&#x10D;i, p&#x159;ivedou sv&#xE9; p&#x159;&#xE1;tele. Nejen&#x17E;e m&#xE1;te obl&#xED;ben&#xE9;ho hr&#xE1;&#x10D;e, ale z&#xED;sk&#xE1;te tak&#xE9; kohokoli, kdo je s t&#xED;mto popul&#xE1;rn&#xED;m hr&#xE1;&#x10D;em spojen.</p>
<p>To plat&#xED; i pro skupiny p&#x159;&#xE1;tel. Kdy&#x17E; p&#xE1;r &#x161;koln&#xED;ch kamar&#xE1;d&#x16F; pozve sv&#xE9; &#x161;koln&#xED; kamar&#xE1;dy tak najednou m&#xE1;te mnohem vy&#x161;&#x161;&#xED; denn&#xED; po&#x10D;et hr&#xE1;&#x10D;&#x16F;. Zkuste sv&#x16F;j server pov&#xFD;&#x161;it na skupiny p&#x159;&#xE1;tel, abyste se ujistili, &#x17E;e v&#xE1;s neopust&#xED; kdy&#x17E; jeden p&#x159;&#xED;tel skon&#x10D;&#xED;, hroz&#xED; &#x17E;e si svoj&#xED; partu vezme sebou!</p>
<h1 id="m%C4%9Bjte-trp%C4%9Blivost">M&#x11B;jte trp&#x11B;livost</h1>
<p>Hled&#xE1;n&#xED; nov&#xFD;ch hr&#xE1;&#x10D;&#x16F; pro v&#xE1;&#x161; Minecraft server m&#x16F;&#x17E;e trvat dlouho. Spr&#xE1;vci server&#x16F; by m&#x11B;li b&#xFD;t trp&#x11B;liv&#xED; a sledovat, jak jejich servery po denn&#xED;ch promo akc&#xED;ch pomalu rostou. Ne&#x10D;ekejte, &#x17E;e p&#x159;&#xED;&#x161;t&#xED; velk&#xFD; server budete m&#xED;t p&#x159;es noc.</p>
<p>Pokud v&#x11B;nujete slu&#x161;n&#xE9; mno&#x17E;stv&#xED; &#x10D;asu hled&#xE1;n&#xED; nov&#xFD;ch hr&#xE1;&#x10D;&#x16F;, pak nakonec p&#x159;ijdou. Pom&#x16F;&#x17E;e, pokud je v&#xE1;&#x161; server jedine&#x10D;n&#xFD; a m&#xE1; co nab&#xED;dnout. Ujist&#x11B;te se, &#x17E;e vyhov&#xED;te pot&#x159;eb&#xE1;m hr&#xE1;&#x10D;&#x16F;, aby mohli hr&#xE1;t na va&#x161;em serveru.</p>
<!--kg-card-end: markdown-->]]></content:encoded></item></channel></rss>